const quizData = [
    {
        question: "1",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Каменный век начался:",
        options: [
            "3.5 млн лет назад",
            "4. 5млн лет назад",
            "6.5 млн лет назад",
            "5.5 млн лет назад",
        ],
        correctAnswer: 0
    },
    {
        question: "2",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Казахстан входил в зону формирования и становления древнейшего человека начиная с:",
        options: [
            "раннего палеолита",
            "среднего палеолита",
            "позднего палеолита",
            "мезолита",
            "неолита",
        ],
        correctAnswer: 0
    },
    {
        question: "3",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Наиболее древние орудия труда найдены в:",
        options: [
            "Центральном Казахстане",
            "Восточном Казахстане",
            "Южном Казахстане",
            "Западном Казахстане",
            "Северном Казахстане",
        ],
        correctAnswer: 2
    },
    {
        question: "4",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Период возникновения рода как формы общественной организации:",
        options: [
            "ранний палеолит",
            "средний палеолит",
            "поздний палеолит",
            "мезолит",
            "неолит",
        ],
        correctAnswer: 1
    },
    {
        question: "5",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Главная тема первобытного искусства:",
        options: [
            "Изображения людей",
            "Изображения природы",
            "Изображения животных",
            "Изображения планет",
            "Изображения природных явлений",
        ],
        correctAnswer: 2
    },
    {
        question: "6",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "По своему антропологическому складу андроновцы были представителями:",
        options: [
            "Европеоидной расы",
            "Негроидной расы",
            "Монголоидной расы",
            "Австралоидной расы",
            "Неизвестно",
        ],
        correctAnswer: 0
    },
    {
        question: "7",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Промежуток хронологии мезолита:",
        options: [
            "XI-V тыс. до н.э.",
            "X-VI тыс. до н.э.",
            "X-VII тыс. до н.э.",
            "X-V тыс. до н.э.",
            "X-VIII тыс. до н.э.",
        ],
        correctAnswer: 3
    },
    {
        question: "8",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Ботайская культура отражает степной энеолит:",
        options: [
            "Центрального Казахстана",
            "Восточного Казахстана",
            "Южного Казахстана",
            "Западного Казахстана",
            "Северного Казахстана",
        ],
        correctAnswer: 4
    },
    {
        question: "9",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Исходный культурный пласт ранних кочевников сформировали племена:",
        options: [
            "Палеолита",
            "Мезолита",
            "Неолита",
            "Бронзового века",
            "Раннего железного века",
        ],
        correctAnswer: 3
    },
    {
        question: "10",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Начато научное исследование каменных орудий первой общинной постройки в Казахстане после:",
        options: [
            "Февральской революции 1917 г.",
            "Октябрьской революции 1917 г.",
            "Гражданской войны 1918-1920 гг.",
            "После Первой мировой войны",
            "После Второй мировой войны",
        ],
        correctAnswer: 1
    },
    {
        question: "11",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Не относится к позднепалеолитическим памятникам Южного Казахстана:",
        options: [
            "Ачсысайская стоянка",
            "Обысайская стоянка",
            "стоянка Батпак",
            "стоянка Канай",
            "стоянка Свинчатка",
        ],
        correctAnswer: 1
    },
    {
        question: "12",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Период развития техники обработки камня:",
        options: [
            "ранний палеолит",
            "средний палеолит",
            "поздний палеолит",
            "мезолит",
            "неолит",
        ],
        correctAnswer: 4
    },
    {
        question: "13",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Освоена подготовка микролитов:",
        options: [
            "ранний палеолит",
            "средний палеолит",
            "поздний палеолит",
            "мезолит",
            "неолит",
        ],
        correctAnswer: 4
    },
    {
        question: "14",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Стали появляться поселения, предшественники городов:",
        options: [
            "Палеолит",
            "Мезолит",
            "Неолит",
            "Энеолит",
            "Бронзовый век",
        ],
        correctAnswer: 4
    },
    {
        question: "15",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Период возникновения отгонного скотоводства:",
        options: [
            "XV до н.э.",
            "XVІІІ до н.э.",
            "XІV до н.э.",
            "X до н.э.",
            "V до н.э.",
        ],
        correctAnswer: 0
    },
    {
        question: "16",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Эпоха первой военной демократии:",
        options: [
            "железный век",
            "эпоха энеолита",
            "бронзовый век",
            "тюркский период",
            "эпоха неолита",
        ],
        correctAnswer: 0
    },
    {
        question: "17",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Информацию о массагетах оставил:",
        options: [
            "Марцеллин",
            "Диадор",
            "Геродот",
            "Прийск",
            "Полибий",
        ],
        correctAnswer: 2
    },
    {
        question: "18",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Способ заточки лезвия однослойных каменных орудий путем выполнения мелких насечек:",
        options: [
            "метод прививки",
            "метод долбления",
            "метод ретуши",
            "метод резки",
            "метод заточки",
        ],
        correctAnswer: 2
    },
    {
        question: "19",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Корни этногенеза казахов уходят в эпоху:",
        options: [
            "раннего палеолита",
            "среднего палеолита",
            "бронзы",
            "позднего палеолита",
            "мезолит",
        ],
        correctAnswer: 2
    },
    {
        question: "20",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В 1970 году новости, привлекшие внимание мировых историков:",
        options: [
            "Обнаружение сакского воина в золотых одеждах в кургане Иссык",
            "находка одетого в золото сакского царя в кургане Шиликти.",
            "находка сарматского мужчины в золотых одеждах из кургана Аралтобе",
            "начало Отырарской экспедиции",
            "возвращение тайказана в город Туркестан",
        ],
        correctAnswer: 0
    },
    {
        question: "21",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В эпоху раннего железа племена западных и части северных районов Казахстана входили  в:",
        options: [
            "сакский племенной союз",
            "савроматскую конфедерацию племен",
            "племенной союз усуней",
            "племенной союз кангюев",
            "племенной союз гуннов",
        ],
        correctAnswer: 1
    },
    {
        question: "22",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Район Казахстана где жили самые древние люди:",
        options: [
            "Северный Казахстан",
            "Западный Казахстан",
            "Южный Казахстан",
            "Восточный Казахстан",
            "Центральный Казахстан",
        ],
        correctAnswer: 2
    },
    {
        question: "23",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Культура эпохи бронзы в Центральном Казахстане:",
        options: [
            "Андронов",
            "Бегазы-Дандибай",
            "Дандибай-Карасу",
            "Бегазы-Атасу",
            "Центральный Казахстан",
        ],
        correctAnswer: 1
    },
    {
        question: "24",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Бронзовый век Казахстана:",
        options: [
            "III-II вв. до н.э.",
            "XVIII-VIII вв. до н.э.",
            "I тысячелетия до н.э.",
            "X-IX вв. до н.э.",
            "X-XI вв. до н.э.",
        ],
        correctAnswer: 1
    },
    {
        question: "25",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Ареалы, где формируется чисто кочевой образ жизни:",
        options: [
            "Восточный и Южный Казахстан",
            "Центральный и Южный Казахстан",
            "Западный и Южный Казахстан",
            "Западный и Центральный Казахстан",
            "Все регионы",
        ],
        correctAnswer: 3
    },
    {
        question: "26",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Районы с развитым полукочевым животноводством:",
        options: [
            "Западный и Центральный Казахстан",
            "Каратауская и Жезказганская области",
            "Алтай, горные районы Жетысу",
            "Во всех регионах",
            "Центральный и Южный районы",
        ],
        correctAnswer: 2
    },
    {
        question: "27",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Ученый, начавший фундаментальные исследования бронзового века в Казахстане:",
        options: [
            "Массон",
            "Маргулан",
            "Алпысбаев",
            "Гумилев",
            "Акишев",
        ],
        correctAnswer: 1
    },
    {
        question: "28",
        options: [
            "Ботай",
            "Пеньки",
            "Усть-Нарымский",
            "Саксаул",
            "Зеленая Балка",
        ],
        correctAnswer: 0
    },
    {
        question: "29",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Движение хуннов на территорию Казахстана началось впервые:",
        options: [
            "в первой половине I в. до н.э.",
            "во второй половине II в. до н.э.",
            "в конце 1 в. н.э.",
            "в середине II в. н.э.",
            "в конце II в. н.э.",
        ],
        correctAnswer: 0
    },
    {
        question: "30",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "С проникновением хуннов на территорию Казахстана связано:",
        options: [
            "развитие торговли",
            "распространение буддизма",
            "имущественное неравенство",
            "изменение антропологического типа населения",
            "появление семейной собственности на скот",
        ],
        correctAnswer: 3
    },
    {
        question: "31",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Знаменитый курган саков на востоке Алматы:",
        options: [
            "Бесшатырский курган",
            "Талгарский курган",
            "Боралдайский курган",
            "Иссыкский курган",
            "могильник Шиликты",
        ],
        correctAnswer: 3
    },
    {
        question: "32",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Начало Великому переселению народов  положили:",
        options: [
            "хунну",
            "канглы",
            "арабы",
            "китайцы",
            "тюргеши",
        ],
        correctAnswer: 0
    },
    {
        question: "33",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Крупнейший древний памятник в Центральном Казахстане, где найдено около 300 каменных орудий, относящихся к позднему палеолиту:",
        options: [
            "Карасу",
            "Атасу",
            "Батпак",
            "Дандибай",
            "Шабахти",
        ],
        correctAnswer: 2
    },
    {
        question: "34",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Древний город урало-казахских степей эпохи бронзы:",
        options: [
            "Тасмола",
            "Аркаим",
            "Актобе",
            "Тамгалы",
            "Бесшатыр",
        ],
        correctAnswer: 1
    },
    {
        question: "35",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Изобретение, связанное с приручением лошадей:",
        options: [
            "верховая езда",
            "употребление мяса и молока",
            "Использование в качестве транспортного средства",
            "Использование кожи",
            "Изобретение стремени и удилы",
        ],
        correctAnswer: 4
    },
    {
        question: "36",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Количество известных мезолитических поселений на территории Казахстана:",
        options: [
            "более 10",
            "более 30",
            "более 40",
            "более 20",
            "более 50",
        ],
        correctAnswer: 3
    },
    {
        question: "37",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Передача знаний древних людей через изобразительное письмо:",
        options: [
            "нумизиматика",
            "петроглиф",
            "Остиология",
            "Топономика",
            "Пиктограмма",
        ],
        correctAnswer: 4
    },
    {
        question: "38",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Саки в персидских источниках назывались:",
        options: [
            "«люди в кожаных доспехах»",
            "«могучие мужами»",
            "«кумани»",
            "«тигрохауды»",
            "«азиатские скифы»",
        ],
        correctAnswer: 1
    },
    {
        question: "39",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Район, где были найдены орудия, относящиеся к эпохе палеолита:",
        options: [
            "Алтайский край",
            "Алатауский край",
            "Жамбылская область",
            "Земли Центрального Казахстана",
            "Алматинская область",
        ],
        correctAnswer: 2
    },
    {
        question: "40",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Один из древних праздников, дошедший до нашего времени:",
        options: [
            "переехать на пастбище",
            "праздник Наурыз",
            "вернуться к зимовке",
            "Обновление Луны",
            "идти в горы",
        ],
        correctAnswer: 1
    },
    {
        question: "41",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Саки - хаомаварга проживали в:",
        options: [
            "Приаралье",
            "в долине Мургаба",
            "Южном Приуралье",
            "на Алтае",
            "в Поволжье",
        ],
        correctAnswer: 1
    },
    {
        question: "42",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Период формирования военной демократии:",
        options: [
            "каменный век",
            "железный век",
            "Эпоха бронзы",
            "Энеолит",
            "эпоха реннесанса",
        ],
        correctAnswer: 1
    },
    {
        question: "43",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Территория расселения саков-парадарайя:",
        options: [
            "Приаралье",
            "Семиречье",
            "Поволжье",
            "долина Мургаба",
            "южном Приуралье",
        ],
        correctAnswer: 0
    },
    {
        question: "44",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Женское божество, покровительница домашнего очага и детей из триады высших божеств тюрок:",
        options: [
            "Тенгри",
            "Йер-су",
            "Умай",
            "Ыдык",
            "Эрлик",
        ],
        correctAnswer: 2
    },
    {
        question: "45",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Неолитическая революция- это:",
        options: [
            "переход от присваивающего хозяйства к производящему",
            "переход к кочевому скотоводству",
            "переход от отгонного скотоводства к кочевому",
            "отделение земледелия от скотоводства",
            "образование племен и племенных объединений",
        ],
        correctAnswer: 0
    },
    {
        question: "46",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Сакский курган, обнаруженный С.С.Черниковым  в Казахстане:",
        options: [
            "Тасмола",
            "Кокмардан",
            "Иссык",
            "Чирик-Рабат",
            "Чиликты",
        ],
        correctAnswer: 4
    },
    {
        question: "47",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Одно из владений государства кангюев в Средней Азии:",
        options: [
            "Ги",
            "Шаш",
            "Черчен",
            "Кашгар",
            "Исфиджаб",
        ],
        correctAnswer: 0
    },
    {
        question: "48",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Основу войск гуннов составляла:",
        options: [
            "пехота",
            "лучники",
            "конница",
            "колесницы",
            "наемники",
        ],
        correctAnswer: 2
    },
    {
        question: "49",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В какой период изготавливались острые каменные орудия:",
        options: [
            "Ранний палеолит",
            "Cредний палеолит",
            "Ограниченный палеолит",
            "Мезолит",
            "Неолит",
        ],
        correctAnswer: 0
    },
    {
        question: "50",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Какие тысячелетия охватывал энеолит:",
        options: [
            "III-II до н. э.",
            "IV-III до н. э.",
            "I-II н. э.",
            "V-IV до н. э.",
            "XI-V до н. э.",
        ],
        correctAnswer: 0
    },
    {
        question: "51",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Какой период включает в себя эпоху среднего палеолита:",
        options: [
            "до н.э. 40-12 тысяч лет",
            "до н.э. 140-40 тысяч лет",
            "до н.э. 12-5 тысяч лет(?)",
            "до н.э. 800-140 тысяч лет",
            "до н.э. 5-3 тысячи лет",
        ],
        correctAnswer: 1
    },
    {
        question: "52",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Автором археологической  периодизации  доистории  считают:",
        options: [
            "Х. Томсена",
            "Л. Моргана",
            "И.Бахофена",
            "Н. Зибера",
            "Г. Мортилье",
        ],
        correctAnswer: 0
    },
    {
        question: "53",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Автором общей (исторической) периодизации доистории считают:",
        options: [
            "Л.Моргана",
            "Г. Мортилье",
            "Х.Томсена",
            "Н. Зибера",
            "О. Монтелиус",
        ],
        correctAnswer: 0
    },
    {
        question: "54",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Хронология раннежелезного века:",
        options: [
            "VIII-III века до н. э.",
            "IV-III века до н. э.",
            "VIII-VII века до н. э.",
            "V-VII века до н. э.",
            "Vl-X века до н. э.",
        ],
        correctAnswer: 0
    },
    {
        question: "55",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В каком районе Казахстана обнаружен памятник каменного века Жагабулак:",
        options: [
            "Западный Казахстан",
            "Южный Казахстан",
            "Северный Казахстан",
            "Центральный Казахстан",
            "Восточный Казахстан",
        ],
        correctAnswer: 0
    },
    {
        question: "56",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Древнетюркская письменность называлась:",
        options: [
            "иероглифическая",
            "согдийская",
            "скифские письмена",
            "санкрит",
            "руническая",
        ],
        correctAnswer: 4
    },
    {
        question: "57",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Титул верховного правителя саков:",
        options: [
            "эльтебер",
            "гурхан",
            "хан",
            "каган",
            "царь",
        ],
        correctAnswer: 4
    },
    {
        question: "58",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Племена, населявшие землю Казахстана в эпоху бронзы:",
        options: [
            "Канлы",
            "Уйсын",
            "Андроновские племена",
            "Гун",
            "Турки",
        ],
        correctAnswer: 2
    },
    {
        question: "59",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Окончательно предпосылки для перехода к кочевому скотоводству сложились на территории Казахстана в эпоху:",
        options: [
            "среднего палеолита",
            "позднего палеолита",
            "ранней бронзы",
            "средней бронзы",
            "поздней бронзы",
        ],
        correctAnswer: 4
    },
    {
        question: "60",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Жилье андроновских племен в XVIII-VIII до н.э.:",
        options: [
            "Пещеры",
            "Юрты",
            "Землянка",
            "Казахские дома",
            "Все данные ответы",
        ],
        correctAnswer: 2
    },
    {
        question: "61",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Какое из этих племен получило название «азиатские скифы»:",
        options: [
            "Канлы",
            "Саки",
            "Монголы",
            "Турики",
            "Уйсыны",
        ],
        correctAnswer: 1
    },
    {
        question: "62",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Направление головы погребенного андроновца:",
        options: [
            "на восток",
            "на север",
            "на запад, на северо-запад",
            "на юг, на восток",
            "назад",
        ],
        correctAnswer: 2
    },
    {
        question: "63",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Титул верховного правителя Уйсуней:",
        options: [
            "Хан",
            "Король",
            "Шаньюй",
            "Гуньмо",
            "Шах",
        ],
        correctAnswer: 3
    },
    {
        question: "64",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Как в письменных источниках называется столица Канлы:",
        options: [
            "Кокмара",
            "Мардан-бурн",
            "Чигучин",
            "Кызыл Ангар",
            "Битянь",
        ],
        correctAnswer: 4
    },
    {
        question: "65",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Знаменитый царь Гуннов, «потрясший» Европу:",
        options: [
            "Алпамыс",
            "Анакарыс",
            "Аттика",
            "Атлант",
            "Аттила",
        ],
        correctAnswer: 4
    },
    {
        question: "66",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "III-V вв. какой стиль развивался в искусстве гунов:",
        options: [
            "Звериный стиль",
            "Полихромный стиль",
            "Цветочный стиль",
            "Техника очистки",
            "Украшение",
        ],
        correctAnswer: 1
    },
    {
        question: "67",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Этноним «тюрк» впервые упомянут в источниках:",
        options: [
            "индийских",
            "персидских",
            "греческих",
            "китайских",
            "монгольских",
        ],
        correctAnswer: 3
    },
    {
        question: "68",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Родоначальник Тюркского каганата:",
        options: [
            "Мукан",
            "Бумын",
            "Истеми",
            "Сулук",
            "Уч-Элик",
        ],
        correctAnswer: 1
    },
    {
        question: "69",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Тюркский каганат достиг   наивысшего могущества при кагане:",
        options: [
            "Бумын",
            "Мукан",
            "Джегуй",
            "Уч-элик",
            "Сакал",
        ],
        correctAnswer: 1
    },
    {
        question: "70",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В Западнотюркском каганате судебные функции выполняли:",
        options: [
            "карабудуны",
            "ябгу, шады",
            "визири, эльтеберы",
            "гуньмо, джабгу",
            "буюруки, тарханы",
        ],
        correctAnswer: 4
    },
    {
        question: "71",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Родоначальник династии тюргешских правителей:",
        options: [
            "Бумын",
            "Мукан",
            "Джегуй",
            "Уч-Элик",
            "Сакал",
        ],
        correctAnswer: 3
    },
    {
        question: "72",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Арабское вторжение на территорию  Казахстана началось:",
        options: [
            "VI в.",
            "VII в.",
            "VIII в.",
            "IХ в.",
            "Х в.",
        ],
        correctAnswer: 2
    },
    {
        question: "73",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Сойыргал   -  это:",
        options: [
            "религиозное   учение",
            "налог",
            "форма землевладения",
            "военная повинность",
            "собственник земли",
        ],
        correctAnswer: 2
    },
    {
        question: "74",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Каган тюргешей, получивший прозвище «Абу Музахим»:",
        options: [
            "Уч-Элик",
            "Сакал",
            "Сулук",
            "Истеми",
            "Сатук",
        ],
        correctAnswer: 2
    },
    {
        question: "75",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Преемник тюргешского кагана Уч-элика:",
        options: [
            "Сулук",
            "Сакал",
            "Джегуй",
            "Ток-джабгу",
            "Сатук",
        ],
        correctAnswer: 1
    },
    {
        question: "76",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Высшее божество тюрков:",
        options: [
            "Митра",
            "Тенгри",
            "Жер-су",
            "Умай",
            "Будда",
        ],
        correctAnswer: 1
    },
    {
        question: "77",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Элиту тюркской аристократии составлял род:",
        options: [
            "кара-будун",
            "ашина",
            "дулу",
            "нушиби",
            "чжичжи",
        ],
        correctAnswer: 1
    },
    {
        question: "78",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В состав карлукского объединения входили племена:",
        options: [
            "дулу, нушиби, чжичжи",
            "булак, чигиль, ташлык",
            "кимаки, кипчаки, киргизы",
            "тюргеши, карлуки, огузы",
            "найманы, кереиты, уйгуры",
        ],
        correctAnswer: 1
    },
    {
        question: "79",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Огузы  делились на две фратрии:",
        options: [
            "дулу и нушиби",
            "бузуки и учуки",
            "уйгуры и карлуки",
            "басмылы и уйгуры",
            "чигиль и ягма",
        ],
        correctAnswer: 1
    },
    {
        question: "80",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Столица огузов:",
        options: [
            "Тараз",
            "Испиджаб",
            "Суяб",
            "Баласагун",
            "Янгикент",
        ],
        correctAnswer: 4
    },
    {
        question: "81",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Карлуки до VIII в. обитали:",
        options: [
            "между Алтаем и Тарбагатаем",
            "в степях Центральной Азии",
            "в Семиречье",
            "в Мавераннахре",
            "на территории Алтая и Монголии",
        ],
        correctAnswer: 0
    },
    {
        question: "82",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Титул   заместителя огузского джабгу:",
        options: [
            "гуньмо",
            "шаньюй",
            "кюль-эркин",
            "тудун",
            "тархан",
        ],
        correctAnswer: 2
    },
    {
        question: "83",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Родоначальник династии Караханидов:",
        options: [
            "Али-хан",
            "Шахмалик-хан",
            "Сатук Богра-хан",
            "Сулук -каган",
            "Сакал-каган",
        ],
        correctAnswer: 2
    },
    {
        question: "84",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Хронологические рамки государства Караханидов:",
        options: [
            "VI- нач. VIII вв.",
            "нач.VII – сер. VII вв.",
            "сер. VII - сер.X вв.",
            "сер. X- нач. XIII вв.",
            "IX- нач. XI вв.",
        ],
        correctAnswer: 3
    },
    {
        question: "85",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Хронологические рамки Тюркского каганата:",
        options: [
            "542-552 гг.",
            "552-603 гг.",
            "604-704 гг.",
            "704-756 гг.",
            "756- 940 гг.",
        ],
        correctAnswer: 1
    },
    {
        question: "86",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "После какого события Бумин стал правителем Тюркского каганата:",
        options: [
            "После победы над Жужанами",
            "После победы над Уйгурским каганатом",
            "после победы над енисейскими кыргызами",
            "после победы над арабами",
            "После победы над эфталитами",
        ],
        correctAnswer: 0
    },
    {
        question: "87",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "“Второй учитель” на Востоке  после Аристотеля:",
        options: [
            "Махмуд Кашгари",
            "Юсуф Баласагуни",
            "Аль- Фараби",
            "Ахмед Яссави",
            "Сулейман Бакыргани",
        ],
        correctAnswer: 2
    },
    {
        question: "88",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Сведения по истории Моголистана содержатся в труде средневекового автора:",
        options: [
            "“Тарихи-Абулхаир хани”, Усмана Кухистани",
            "Джами ат-таварих”, Рашид",
            "“Тарих-и-Рашиди”, Мухамеда Хайдара",
            "“Михман-наме-ий Бухара”, Фазлаллаха ибн Розбе-хана",
            "“Диван лугат ат-турк”, Махмут Кашгари.",
        ],
        correctAnswer: 2
    },
    {
        question: "89",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В Х в. ислам объявлен государственной религией в:",
        options: [
            "Тюргешском каганате",
            "Моголистане",
            "в государстве  Караханидов",
            "Узбекском ханстве",
            "Ногайской орде",
        ],
        correctAnswer: 2
    },
    {
        question: "90",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Тюргеши занимали территорию между реками:",
        options: [
            "Чу и Или",
            "Чу и Ишим",
            "Сыр-Дарья и Аму-Дарья",
            "Или и Иртыш",
            "Чу и Иртыш",
        ],
        correctAnswer: 0
    },
    {
        question: "91",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Время  существования Западнотюркского каганата:",
        options: [
            "542-552 гг.",
            "552-603 гг.",
            "603-704 гг.",
            "704-756 гг.",
            "756-940 гг.",
        ],
        correctAnswer: 2
    },
    {
        question: "92",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Время существования  Кипчакского ханства:",
        options: [
            "нач. VI - нач. VII вв.",
            "нач. VII- сер. VIIIвв.",
            "нач. VII- нач.X вв.",
            "нач. XI- нач. XIII вв.",
            "сер.XII- нач. XIII вв.",
        ],
        correctAnswer: 3
    },
    {
        question: "93",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Распад Тюркского каганата произошел в:",
        options: [
            "505 г.",
            "542 г.",
            "552 г.",
            "603 г.",
            "704 г.",
        ],
        correctAnswer: 3
    },
    {
        question: "94",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Эпоха с VI-ХШ вв. в истории Казахстана  известна как:",
        options: [
            "согдийская",
            "арабская",
            "тюркская",
            "монгольская",
            "кыпчакская",
        ],
        correctAnswer: 2
    },
    {
        question: "95",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Тексты в честь Бильге-кагана и Кюль-тегина написаны  письмом:",
        options: [
            "латинским",
            "китайским",
            "руническим",
            "арабским",
            "монгольским",
        ],
        correctAnswer: 2
    },
    {
        question: "96",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Распад Западнотюркского каганата связан с:",
        options: [
            "вторжением  арабов",
            "борьбой с джунгарами",
            "нашествием монголов",
            "нападением карлуков",
            "междоусобицей и вторжением танских войск",
        ],
        correctAnswer: 4
    },
    {
        question: "97",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Значение слова «Тат»:",
        options: [
            "богатый",
            "Бек",
            "Буйрык",
            "Раб",
            "Сборщики налогов",
        ],
        correctAnswer: 3
    },
    {
        question: "98",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В Западнотюркском каганате «черными будунами» называли:",
        options: [
            "Аристократы",
            "Военный",
            "Обычные люди",
            "Торговцы",
            "Ремесленники",
        ],
        correctAnswer: 2
    },
    {
        question: "99",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В  образовании государства Караханидов сыграли  роль племена:",
        options: [
            "кипчаки, аргыны, найманы",
            "карлуки, чигиль, ягма",
            "теле, дулу,нушиби",
            "усуни, кангюи,  хунну",
            "уйгуры, басмылы, карлуки",
        ],
        correctAnswer: 1
    },
    {
        question: "100",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Хан  Восточного Дешт-и-Кыпчака  происходил  из  рода:",
        options: [
            "токсаба",
            "ельбори",
            "кайы-уран",
            "кангар",
            "карлык",
        ],
        correctAnswer: 1
    },
    {
        question: "101",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Каган, которого арабы называли Сузегеном:",
        options: [
            "Сулу",
            "Билге",
            "Бумын",
            "Тон",
            "Мукан",
        ],
        correctAnswer: 0
    },
    {
        question: "102",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Поход войск  Чингис-хана в Казахстан и Среднюю Азию начался  в:",
        options: [
            "1211 г.",
            "1217 г.",
            "1218 г.",
            "1219 г.",
            "1220 г.",
        ],
        correctAnswer: 3
    },
    {
        question: "103",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Степные районы Казахстана достались сыну Чингиз-хана:",
        options: [
            "Чагатаю",
            "Тулую",
            "Джучи",
            "Угэдею",
            "Тохтамышу",
        ],
        correctAnswer: 2
    },
    {
        question: "104",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Левое крыло Золотой Орды возглавлял:",
        options: [
            "Батый",
            "Джучи",
            "Орда Еджен",
            "Тулуй",
            "Чагатай",
        ],
        correctAnswer: 2
    },
    {
        question: "105",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Золотая Орда стала независимой от Монгольской империи при хане:",
        options: [
            "Батый",
            "Орда-Еджен",
            "Берке",
            "Мунке",
            "Узбек",
        ],
        correctAnswer: 2
    },
    {
        question: "106",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Хан, объявивший ислам государственной религией Золотой Орды:",
        options: [
            "Батый",
            "Узбек",
            "Менгу",
            "Мунке",
            "Тохтамыш",
        ],
        correctAnswer: 1
    },
    {
        question: "107",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Золотая Орда достигла наибольшего могущества при хане:",
        options: [
            "Батый",
            "Узбек",
            "Менгу",
            "Мунке",
            "Тохтамыш",
        ],
        correctAnswer: 1
    },
    {
        question: "108",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Столица Ак-Орды:",
        options: [
            "Тараз",
            "Сыгнак",
            "Сарай-Берке",
            "Сузак",
            "Исфиджаб",
        ],
        correctAnswer: 1
    },
    {
        question: "109",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Территория Юго-Восточного Казахстана в сер. ХIV- нач. ХVI вв. входила в государство:",
        options: [
            "Могулистан",
            "Ногайская Орда",
            "Узбекский  улус",
            "Хайду",
            "Монголии",
        ],
        correctAnswer: 0
    },
    {
        question: "110",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Улус Джучи занимал территорию:",
        options: [
            "к западу от Иртыша",
            "большей части Семиречья",
            "Восточного Туркестана",
            "Западной Монголии",
            "верховья Иртыша и Тарбагатая",
        ],
        correctAnswer: 0
    },
    {
        question: "111",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Улус Угэдея занимал территорию:",
        options: [
            "от Иртыша до Волги",
            "районы Верхнего Иртыша и Тарбагатая",
            "Восточного Туркестана и Мавераннахра",
            "южнорусские земли",
            "от Волги до Дуная",
        ],
        correctAnswer: 1
    },
    {
        question: "112",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Основатель династии Могулистан:",
        options: [
            "Эмир Пуладчи",
            "Эмир Тимур",
            "Урус-хан",
            "Узбек-хан",
            "Тоглук-Тимур",
        ],
        correctAnswer: 1
    },
    {
        question: "113",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Формы условного землевладения  знати в Могулистане:",
        options: [
            "сойургал, инджу",
            "зякет, ушур",
            "согум, сыбыга",
            "мулк, вакф",
            "тагар, бадж",
        ],
        correctAnswer: 0
    },
    {
        question: "114",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Первый правитель Могулистана:",
        options: [
            "Есен-буга",
            "Тоглук-Тимур",
            "Ильяс-Ходжа",
            "Мухаммед",
            "Вайс",
        ],
        correctAnswer: 1
    },
    {
        question: "115",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В  Х в. ислам приняло государство:",
        options: [
            "кимаков",
            "кипчаков",
            "огузов",
            "карлуков",
            "караханидов",
        ],
        correctAnswer: 4
    },
    {
        question: "116",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Ислам объявлен государственной религией в государстве Караханидов правителем:",
        options: [
            "Кадыр",
            "Шахмалик",
            "Али",
            "Сатук Богра",
            "Богра Харун Муса",
        ],
        correctAnswer: 4
    },
    {
        question: "117",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Территория  Восточного  Дешт-и-Кыпчака  включала:",
        options: [
            "земли к западу от Волги до Дуная",
            "степные районы Казахстана к западу от Иртыша до Волги",
            "междуречье Сырдарьи и Амударьи",
            "междуречье Чу и Таласа",
            "междуречье Урала и Волги",
        ],
        correctAnswer: 1
    },
    {
        question: "118",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Распространитель поэзии духовного  направления в Казахстане:",
        options: [
            "Аль-Фараби",
            "С.Бакыргани",
            "М.Кашгари",
            "Рашид-ад-Дин",
            "К.Жалаири",
        ],
        correctAnswer: 1
    },
    {
        question: "119",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В Х- Х1 вв. кипчаки были в составе государства:",
        options: [
            "огузов",
            "караханидов",
            "саманидов",
            "кимаков",
            "карлуков",
        ],
        correctAnswer: 3
    },
    {
        question: "120",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Институт коммендации в государстве Караханидов – это:",
        options: [
            "вакфные  земли",
            "натуральное и денежное содержание для военных лиц",
            "земельная собственность",
            "доход в виде сельскохозяйственных продуктов",
            "переход мелкого собственника под покровительство  крупного  землевладельца",
        ],
        correctAnswer: 4
    },
    {
        question: "121",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Мавзолей религиозному мыслителю ХІІ в.эмир Тимур возвел в городе:",
        options: [
            "Тараз",
            "Отрар",
            "Сайрам",
            "Сыганак",
            "Туркестан",
        ],
        correctAnswer: 4
    },
    {
        question: "122",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Автор поэмы «Кутадгу билиг»:",
        options: [
            "Аль-Фараби",
            "Ахмед Яссави",
            "Махмуд Кашгари",
            "Юсуф Баласагуни",
            "Мухаммад Хайдар Дулати",
        ],
        correctAnswer: 3
    },
    {
        question: "123",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Автор «Диван лугат-ат- тюрк» (Словарь тюркских наречий):",
        options: [
            "Аль-Бируни",
            "Аль-Фараби",
            "Махмуд Кашгари",
            "Ахмед Яссави",
            "Юсуф Баласагуни",
        ],
        correctAnswer: 2
    },
    {
        question: "124",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Автор «Тарих-и-Рашиди»:",
        options: [
            "Мухаммед Хайдар Дулати",
            "Юсуф Баласагуни",
            "Махмуд Кашгари",
            "Ахмед Ясави",
            "Аль-Фараби",
        ],
        correctAnswer: 0
    },
    {
        question: "125",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В 1457 г. поражение Абулхайр-хану нанесли:",
        options: [
            "енисейские киргизы",
            "ойраты",
            "кыпчаки",
            "мангыты",
            "канглы",
        ],
        correctAnswer: 1
    },
	{
        question: "126",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Наиболее крупное племя  Ногайской Орды:",
        options: [
            "ойраты",
            "карлуки",
            "кипчаки",
            "мангыты",
            "канглы",
        ],
        correctAnswer: 3
    },
    {
        question: "127",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Основатель государства кочевых узбеков:",
        options: [
            "Едыге",
            "Пуладчи",
            "Абулхайр",
            "Тоглук-Тимур",
            "Шайх Хайдар",
        ],
        correctAnswer: 2
    },
    {
        question: "128",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Поводом  для нашествия монголов на государство Хорезмшаха послужило:",
        options: [
            "ущемление прав мусульман",
            "столкновение войск Джучи и Хорезмшаха",
            "«отрарская катастрофа»",
            "антимонгольские выступления  хорезмийцев",
            "военный союз народов Центральной Азии",
        ],
        correctAnswer: 2
    },
    {
        question: "129",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Законы Чингиз-хана назывались:",
        options: [
            "Адат",
            "Торе",
            "Яса",
            "Жеты-Жаргы",
            "Шариат",
        ],
        correctAnswer: 2
    },
    {
        question: "130",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Белая орда стала независимой от Золотой Орды в правление ханов:",
        options: [
            "Бату, Орда-Ерджена",
            "Ерзена, Мубарака",
            "Тохтамыша, Тимура",
            "Барака, Уруса",
            "Тоглук-Тимура, Ильяс-Ходжы",
        ],
        correctAnswer: 1
    },
    {
        question: "131",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Укрепление Белой Орды произошло при хане:",
        options: [
            "Бату",
            "Орда-Ерджен",
            "Тоглук-Тимур",
            "Урус",
            "Едыге",
        ],
        correctAnswer: 3
    },
    {
        question: "132",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Первые могулистанские ханы отражали нападения:",
        options: [
            "Абулхаира",
            "Тохтамыша",
            "Тимура",
            "Уруса",
            "Барака",
        ],
        correctAnswer: 2
    },
    {
        question: "133",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В 20-х гг. XV в.  на территории Казахстана образовалось государство:",
        options: [
            "Золотая Орда",
            "Белая Орда",
            "Синяя Орда",
            "Моголистан",
            "Ханство Абулхайра",
        ],
        correctAnswer: 4
    },
    {
        question: "134",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Золотая Орда стала независимой от  Монгольской империи  при хане:",
        options: [
            "Менгу",
            "Берке",
            "Хубилай",
            "Урус",
            "Узбек",
        ],
        correctAnswer: 1
    },
    {
        question: "135",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Преемник Джучи хана:",
        options: [
            "Орда-Еджен",
            "Барак",
            "Бату",
            "Хубилай",
            "Берке",
        ],
        correctAnswer: 2
    },
    {
        question: "136",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Южный и Юго-Восточный Казахстан вошли в состав улуса:",
        options: [
            "Джучи",
            "Чагатая",
            "Угэдея",
            "Тулуя",
            "Хубилая",
        ],
        correctAnswer: 1
    },
    {
        question: "137",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "«Яссы» Чингис-хана – это:",
        options: [
            "священная книга тюрков",
            "кодифицированный сборник обычного права",
            "нормы мусульманского права",
            "учение о культе Будды",
            "трактат учения даосизма",
        ],
        correctAnswer: 1
    },
    {
        question: "138",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Название Дешт-и-Кыпчак появилось в :",
        options: [
            "VIII в.",
            "VI в.",
            "V в.",
            "ХI в.",
            "ХVI в.",
        ],
        correctAnswer: 3
    },
    {
        question: "139",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В результате распада Ак Орды образованы:",
        options: [
            "Астраханское и Крымское ханства.",
            "Казанское и Сибирское ханства.",
            "Моголистан.",
            "Ногайская орда и ханство Абулхайра.",
            "Казахское ханство.",
        ],
        correctAnswer: 3
    },
    {
        question: "140",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Едиге основал государство:",
        options: [
            "Казахское ханство",
            "Сибирское ханство",
            "Моголистан",
            "Ногайскую Орду",
            "Астрахаснкое ханство",
        ],
        correctAnswer: 3
    },
    {
        question: "141",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Государство Чингис-хана стало называться «Еке Монгол улус» (Великое Монгольское государство) с:",
        options: [
            "1206 г.",
            "1207 г.",
            "1209 г.",
            "1210 г.",
            "1211 г.",
        ],
        correctAnswer: 4
    },
    {
        question: "142",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Шайбанид Абулхайр  избран ханом  в:",
        options: [
            "1428 г.",
            "1435 г.",
            "1486 г.",
            "1490 г.",
            "1491 г.",
        ],
        correctAnswer: 0
    },
    {
        question: "143",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Столица Монгольской империи при Чингис-хане:",
        options: [
            "Сыгнак",
            "Сарай",
            "Сарай-Берке",
            "Сарай-Бату",
            "Каракорум",
        ],
        correctAnswer: 4
    },
    {
        question: "144",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Годы правления Чингис-хана:",
        options: [
            "1206-1227 гг.",
            "1227-1242 гг.",
            "1227-1255 гг.",
            "1257-1266 гг.",
            "1269-1271 гг.",
        ],
        correctAnswer: 0
    },
    {
        question: "145",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Годы правления Узбек хана:",
        options: [
            "1312-1342 гг.",
            "1320-1360 гг.",
            "1325-1365 гг.",
            "1255-1263 гг.",
            "1227-1255 гг.",
        ],
        correctAnswer: 0
    },
    {
        question: "146",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Столица Золотой Орды:",
        options: [
            "Узкент",
            "Сайрам",
            "Сарай",
            "Сарай-Бату",
            "Кызылкум",
        ],
        correctAnswer: 3
    },
    {
        question: "147",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Год Мамаевской битвы с Донским на Куликовом поле",
        options: [
            "1260 год",
            "1380 год",
            "1357 год",
            "1460 год",
            "1462 год",
        ],
        correctAnswer: 1
    },
    {
        question: "148",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Годы великой паники (смуты) Золотой Орды",
        options: [
            "1357-1380 гг.",
            "1360-1380 гг.",
            "1402-1405 гг.",
            "1410-1412 гг.",
            "1405-1407 гг.",
        ],
        correctAnswer: 0
    },
    {
        question: "149",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Правитель Золотой Орды объявивший ислама государственной религией:",
        options: [
            "Батый",
            "Берке",
            "Узбек-хан",
            "Менгу Темир",
            "Токтамыс",
        ],
        correctAnswer: 2
    },
    {
        question: "150",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Хан, пришедший к власти в Золотой Орде при поддержке Амира Темира:",
        options: [
            "Аз-Жанибек хан",
            "Берке хан",
            "Батый хан",
            "Токтамыс хан",
            "Узбек-хан",
        ],
        correctAnswer: 3
    },
    {
        question: "151",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Значение этнонима «казах», употреблявшегося до XIII века:",
        options: [
            "Свободные люди",
            "воины",
            "Кочевники",
            "пастухи",
            "Фермеры",
        ],
        correctAnswer: 0
    },
    {
        question: "152",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Основатели Казахского ханства:",
        options: [
            "Бурындык и Касым",
            "Жаныбек и Керей",
            "Есен Буга и Юнус хан",
            "Батый и Берке",
            "Хакназар и Шыгай",
        ],
        correctAnswer: 1
    },
    {
        question: "153",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Население Казахского ханства   достигло I млн. человек при хане:",
        options: [
            "Жаныбеке и Керее",
            "Тауке",
            "Касыме",
            "Хакназаре",
            "Есиме",
        ],
        correctAnswer: 2
    },
    {
        question: "154",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Казахские ханы в XVI-XVIII вв. избирались из сословия:",
        options: [
            "биев",
            "ходжей",
            "баев",
            "султанов",
            "иманов",
        ],
        correctAnswer: 3
    },
    {
        question: "155",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Племена суаны, ысты, жалаиры входили в жуз:",
        options: [
            "Старший",
            "Средний",
            "Младший",
            "мангытов",
            "монголов",
        ],
        correctAnswer: 0
    },
    {
        question: "156",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Дипломатические отношения  казахов с Московским государством  впервые установились при хане:",
        options: [
            "Тауке",
            "Абулхаире",
            "Аблая",
            "Касыме",
            "Жаныбеке и Керее",
        ],
        correctAnswer: 3
    },
    {
        question: "157",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В первой половине XVIII в. Казахстан для России представлял интерес как:",
        options: [
            "источник сырья",
            "«ключи и врата» в Азию",
            "дешевая рабочая сила Казахстана",
            "рынок сбыта",
            "военный союзник",
        ],
        correctAnswer: 1
    },
    {
        question: "158",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В казахско – джунгарской битве 1643 г.  казахское войско возглавил хан:",
        options: [
            "Тауке",
            "Аблай",
            "Тевеккель",
            "Есим",
            "Жангир",
        ],
        correctAnswer: 4
    },
    {
        question: "159",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Первое слово, употребленное вместо этнонима «казах»:",
        options: [
            "Кипчак",
            "Узбек",
            "Алаш",
            "Уйсун",
            "Турк",
        ],
        correctAnswer: 2
    },
    {
        question: "160",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Казахский жырау, советник ханов Тауке и Аблая:",
        options: [
            "Шалкииз",
            "Доспамбет",
            "Таттикара",
            "Бухар",
            "Умбетей",
        ],
        correctAnswer: 3
    },
    {
        question: "161",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Религиозный  центр  Казахского ханства:",
        options: [
            "Сауран",
            "Сыгнак",
            "Яссы (Туркестан)",
            "Сузак",
            "Отрар",
        ],
        correctAnswer: 2
    },
    {
        question: "162",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Годы правлния Жанибек хана:",
        options: [
            "1474-1480",
            "1582-1598",
            "1480-1482",
            "1643-1652",
            "1711-1718",
        ],
        correctAnswer: 0
    },
    {
        question: "163",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Ханом казахов и калмыков называл себя:",
        options: [
            "Аблай",
            "Тауке",
            "Жангир",
            "Тауекель",
            "Есим",
        ],
        correctAnswer: 3
    },
    {
        question: "164",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В 1595 г.переговоры  с ханом Тауекелем вел:",
        options: [
            "Тевкелев",
            "Чубуков",
            "Степанов",
            "Строганов",
            "Беляков",
        ],
        correctAnswer: 2
    },
    {
        question: "165",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Народное ополчение трех казахских жузов  в 1726 г. возглавил:",
        options: [
            "Кабанбай",
            "Райымбек",
            "Богенбай",
            "Абулхаир",
            "Саурык",
        ],
        correctAnswer: 3
    },
    {
        question: "166",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Царь, принявший предложение подчинить себе Младший жуз:",
        options: [
            "Петр I",
            "Анна Иоанновна",
            "Елизавета Петровна",
            "Павел I",
            "Александр I",
        ],
        correctAnswer: 1
    },
    {
        question: "167",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Послы, которых отправил хан Абулхаир для ведения переговоров о присоединении казахов к России:",
        options: [
            "Толе би, Акбайулы",
            "Габитулы, Жанжигитулы",
            "Богенбай батыр, Баян батыр",
            "Кундагулулы, Коштайулы",
            "Аманулы, Темирулы",
        ],
        correctAnswer: 3
    },
    {
        question: "168",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Казахское ханство переживало период упадка при хане:",
        options: [
            "Хаккназаре",
            "Касыме",
            "Аблае",
            "Тауке",
            "Тахире",
        ],
        correctAnswer: 4
    },
    {
        question: "169",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Внутренняя  орда  образована  в:",
        options: [
            "1701 г.",
            "1711 г.",
            "1801 г.",
            "1803 г.",
            "1811 г.",
        ],
        correctAnswer: 2
    },
    {
        question: "170",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Автор древней история казахского ханства и его ценность в средневековой мусульманской историографии сочинение- Тарихи и-Рашиди:",
        options: [
            "Мирза Мухаммед Хайдар Дулати",
            "Неизвестный автор",
            "Мухаммед Салих",
            "Ибн Рузбихан",
            "Мухамед Шайбани хан",
        ],
        correctAnswer: 0
    },
    {
        question: "171",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В какой местности был заложена основа Казахского ханства:",
        options: [
            "Южно-Казахстанская",
            "Центральный Казахстан",
            "Западно-Казахстанская",
            "Жетысу",
            "Восточно-Казахстанская",
        ],
        correctAnswer: 3
    },
    {
        question: "172",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Потомки какого хана были основатели династии казахских ханов:",
        options: [
            "Шагатай",
            "Араб-Мухаммед хан",
            "Орыс хан",
            "Тока-Темир",
            "Койыршах",
        ],
        correctAnswer: 2
    },
    {
        question: "173",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Реальная власть в Казахском ханстве во время правления Бурындык:",
        options: [
            "Tауке",
            "Касым",
            "Таныш",
            "Жаныш",
            "Жадик",
        ],
        correctAnswer: 1
    },
    {
        question: "174",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Хан Могулситана, который не возражал переселения  Керея и Жанибека в Жетысу:",
        options: [
            "Жунус хан",
            "Есенбуга хан",
            "Уайс хан",
            "Абд ар-Рашид хан",
            "Султан Саид",
        ],
        correctAnswer: 1
    },
    {
        question: "175",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Автор труда Юго-Восточный Казахстан в середине ХIV-ХVI вв. в начале...:(?)",
        options: [
            "К. Пищулина",
            "И. Ерофеева",
            "Е. Бекмаханов",
            "Н. Панкратова",
            "М. Абусеитова",
        ],
        correctAnswer: 0
    },
    {
        question: "176",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "870 год Хиджры– :",
        options: [
            "1465-1466 годы",
            "1466-1467 годы",
            "1467-1468 годы",
            "1468-1469 годы",
            "1469-1470 годы",
        ],
        correctAnswer: 0
    },
    {
        question: "177",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В конце XV в. – XVI в. сначал(?)а шла борьба между казахскими ханами и шайбанидами:",
        options: [
            "из за городов Жетысу",
            "из за Сырдарьинского региона",
            "из за Восточного Дешт-и-Кипчака",
            "из за зоны между Волгой и Уралом",
            "из за города Ташкента",
        ],
        correctAnswer: 1
    },
    {
        question: "178",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В 1726 году произошла битва у реки…….в местности Карасиыр:",
        options: [
            "Анракайская битва",
            "Битва Аякоз",
            "Битва Буланты",
            "Орбулакское сражение",
            "Туркестанская битва.",
        ],
        correctAnswer: 2
    },
    {
        question: "179",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Сын Есим-хана, который был ханом в 1628 - 1652 годах:",
        options: [
            "Тауке",
            "Шыгай",
            "Тауекел",
            "Жангир",
            "Турсын",
        ],
        correctAnswer: 3
    },
    {
        question: "180",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Имя, данное народом Жангир-хану за его чудесные подвиги:",
        options: [
            "Еңегей ер Жангир",
            "Салқам Жангир",
            "Батыр Жангир",
            "Гигантский Жангир",
            "богатырь с огромным телом",
        ],
        correctAnswer: 1
    },
    {
        question: "181",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Жангир хан сражался с 600 солдатами против 50 тысяч джунгарских воинов:",
        options: [
            "Аныракай",
            "Аягоз",
            "Калмыцкая битва",
            "Орбулак",
            "Буланты",
        ],
        correctAnswer: 3
    },
    {
        question: "182",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Год Орбулакской битвы:",
        options: [
            "1628 г.",
            "1630 г.",
            "1640 г.",
            "1642 г.",
            "1643 г.",
        ],
        correctAnswer: 4
    },
    {
        question: "183",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Kоличество городов, захваченных джунгарскими войсками в Семиречье и Южном Казахстане в 70-е годы ХІІІ века:",
        options: [
            "девять",
            "десять",
            "двенадцать",
            "пятнадцать",
            "четырнадцать",
        ],
        correctAnswer: 0
    },
    {
        question: "184",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "годы правления Тауке хана:",
        options: [
            "1628-1655 гг.",
            "1628 – 1652 гг.",
            "1680 - 1715 гг.",
            "1682 – 1718 гг.",
            "1682 – 1719 гг.",
        ],
        correctAnswer: 2
    },
    {
        question: "185",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Столица при Тауке-Хане:",
        options: [
            "Cыганак",
            "Туркестан",
            "Сайрам",
            "Сауран",
            "Суяб",
        ],
        correctAnswer: 1
    },
    {
        question: "186",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Hачиная с 40-х годов XVII века, государство, представлявшее угрозу Казахскому ханству:",
        options: [
            "Кокан",
            "Китай",
            "Джунгария",
            "Россия",
            "Иран",
        ],
        correctAnswer: 2
    },
    {
        question: "187",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "После смерти Тауке в 1715 г. его преемник:",
        options: [
            "Самекe",
            "Абулхаир",
            "Каип",
            "Абильмамбет",
            "Абылай",
        ],
        correctAnswer: 2
    },
    {
        question: "188",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Цель Джунгарии, организовавшей разрушительные походы в Казахстан:",
        options: [
            "ослабление и уничтожение казахских отрядов",
            "одновременная война с казахами и Россией",
            "установление экономических, торговых связей с казахами",
            "уничтожить независимость казахского народа и обратить на себя необъятные земли",
            "демонстрация превосходства джунгарской армии",
        ],
        correctAnswer: 3
    },
    {
        question: "189",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "1723 г. Причина, по которой Джунгария получила возможность направить все свои силы против казахов:",
        options: [
            "самозванство казахских феодалов",
            "нападение казанских, хивинских ханств на казахскую землю",
            "смерть императора Цинь Канси",
            "ослабление казахов в борьбе с каракалпаками и узбеками",
            "нападение империи Цин на казахскую землю",
        ],
        correctAnswer: 2
    },
    {
        question: "190",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "«Актабан шубырынды», трагедия казахского народа:",
        options: [
            "в 40-е годы XVII в.",
            "середина XVIII в.",
            "20-е годы XVIII в.",
            "в 30-е годы XVIII в.",
            "в 40-е годы XVIII в.",
        ],
        correctAnswer: 2
    },
    {
        question: "191",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Вторжение джунгар в Казахстан:",
        options: [
            "1723 г.",
            "1724 г.",
            "1726 г.",
            "1727 г.",
            "1729 г.",
        ],
        correctAnswer: 0
    },
    {
        question: "192",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Земля, сильно разбитая Джунгарским нашествием:",
        options: [
            "пригород Сырдарьи",
            "Восточный Туркестан",
            "Ташкент",
            "пригород Каратау",
            "Жетысу",
        ],
        correctAnswer: 4
    },
    {
        question: "193",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Удар казахов по калмыкам вдоль реки Буланты:",
        options: [
            "1618 г.",
            "1690 г.",
            "1713 г.",
            "1726 г.",
            "1729 г.",
        ],
        correctAnswer: 3
    },
    {
        question: "194",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Командовал всеми отрядами под Анракаем:",
        options: [
            "Кабанбай",
            "Богенбай",
            "Райымбек",
            "Абулхаир",
            "Абылай",
        ],
        correctAnswer: 3
    },
    {
        question: "195",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Битва при Анракае:",
        options: [
            "1719-1920 гг.",
            "1723-1725 гг.",
            "1726-1727 гг.",
            "1729-1730 гг.",
            "1740-1741 гг.",
        ],
        correctAnswer: 3
    },
    {
        question: "196",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Значение битвы «Калмакырылган», состоявшейся в 1726:",
        options: [
            "освобожден северо-запад Казахстана",
            "полностью освобождена казахская земля",
            "джунгары отступили к своей стране, пройдя реку Или",
            "регион Жетысу полностью освобожден",
            "освобождены земли младшего, среднего жуза",
        ],
        correctAnswer: 0
    },
    {
        question: "197",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "1726 г. Событие, ставшее началом разгрома джунгар казахскими отрядами:",
        options: [
            "Аныракай",
            "Калмаккырылган",
            "аягозская битва",
            "Орбулакское сражение",
            "Ойрантобе",
        ],
        correctAnswer: 1
    },
    {
        question: "198",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Казахский батыр отличившийся в борьбе с джунгарами:",
        options: [
            "Жоламан",
            "Богенбай",
            "Исатай",
            "Амангельды",
            "Сырым",
        ],
        correctAnswer: 1
    },
    {
        question: "199",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "После смерти Болат хана казахские ханы, боровшиеся за старшее ханство:",
        options: [
            "Абильхаир и Абильмамбет",
            "Самеке и Абильхаир",
            "Самеке и Абильмамбет",
            "Батыр и Такыр",
            "Абильхаир и Батыр",
        ],
        correctAnswer: 1
    },
    {
        question: "200",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Война между казахами и джунгарами возле реки Аякоз:",
        options: [
            "1712 г.",
            "1715 г.",
            "1718 г.",
            "1720 г.",
            "1723 г.",
        ],
        correctAnswer: 2
    },
    {
        question: "201",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Завоевание джунгаров Ташкента и Туркестана:",
        options: [
            "1711-1712 гг.",
            "1714-1715 гг.",
            "1718-1719 гг.",
            "1720-1721 гг.",
            "1724-1725 гг.",
        ],
        correctAnswer: 4
    },
    {
        question: "202",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Причина скопления казахских отрядов у горы Ордабасы на юге Казахстана:",
        options: [
            "получение российской помощи было приемлемым",
            "был благоприятен для сторонников джунгар",
            "пригодные для получения пищи",
            "это место было близко к освобождению Семиречья",
            "было удобно отступать в случае ослабления",
        ],
        correctAnswer: 3
    },
    {
        question: "203",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Начало присоединения Казахстана к России:",
        options: [
            "1726 г.",
            "1729 г.",
            "1731 г.",
            "1733 г.",
            "1735 г.",
        ],
        correctAnswer: 2
    },
    {
        question: "204",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Царь, принявший предложение взять под власть Младший жуз:",
        options: [
            "Петр I",
            "Анна Иоанновна",
            "Елизавета Петровна",
            "Павел I",
            "Александр I",
        ],
        correctAnswer: 1
    },
    {
        question: "205",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "XVIIв.  Организатор присоединения казахов к России:",
        options: [
            "Батыр султан",
            "Тауке хан",
            "Абылай хан",
            "Абулхаир хан",
            "Самеке хан",
        ],
        correctAnswer: 2
    },
    {
        question: "206",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Послы, проводившие соглашение о присоединении казахов к России от хана Младшего жуза Абулхаира:",
        options: [
            "Толе улы, Акбайулы",
            "Габитулы, Жанжигитулы",
            "Богенбай батыр, Баян батыр",
            "Кундагулулы, Коштайулы",
            "Аманулы, Темирулы",
        ],
        correctAnswer: 3
    },
    {
        question: "207",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Число старшин Младшего жуза, принявших присягу на вступление под власть России в 1731 г.:",
        options: [
            "29 старшина",
            "28 старшина",
            "25 старшина",
            "20 старшина",
            "21 старшина",
        ],
        correctAnswer: 0
    },
    {
        question: "208",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Посольством России для принятия присяги от казахов был направлен:",
        options: [
            "Т.Чебуков",
            "В.Степанов",
            "В.Татищев",
            "М.Гагарин",
            "А.Тевкелев",
        ],
        correctAnswer: 4
    },
    {
        question: "209",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Крепость, построенная в 1735 году вдоль реки на севере Казахстана:",
        options: [
            "Жамиш",
            "Ор",
            "Устькемен",
            "Железинск",
            "Коряков",
        ],
        correctAnswer: 1
    },
    {
        question: "210",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Основная цель Абулхаира присоединиться к России:",
        options: [
            "Разрушение памяти противников",
            "Развитие животноводства",
            "установление надежных отношений с Россией и мобилизация имеющихся силы против калмыков",
            "получение высокой должности",
            "оседлой образ жизни",
        ],
        correctAnswer: 2
    },
    {
        question: "211",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В 1738 г. глава Оринборской комиссии, созвавшей в Оринборе съезд казахских султанов:",
        options: [
            "И. Кириллов",
            "В. Татищев",
            "А. Тевкелев",
            "П.Зернов",
            "В. Степанов",
        ],
        correctAnswer: 1
    },
    {
        question: "212",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Кто убил Абилкайыра  в 1748 году:",
        options: [
            "Абульпайиз",
            "Кайып",
            "Абульмамбет",
            "Барак султан",
            "Надир Шах",
        ],
        correctAnswer: 3
    },
    {
        question: "213",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Для подавления восстания башкир царское правительство направило дружин в Младший жуз:",
        options: [
            "1731-1734 гг.",
            "1735-1737 гг.",
            "1737-1738 гг.",
            "1738-1739 гг.",
            "1739-1740 гг.",
        ],
        correctAnswer: 1
    },
    {
        question: "214",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В 1740 г. государство, угрожавшее границе Младшего жуза:",
        options: [
            "Хивинское ханство",
            "Китай",
            "Джонгария",
            "Иран",
            "Россия",
        ],
        correctAnswer: 3
    },
    {
        question: "215",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Строительство города Орынбор:",
        options: [
            "в 1734 г.",
            "в 1736 г.",
            "в 1743 г.",
            "в 1747 г.",
            "в 1749 г.",
        ],
        correctAnswer: 2
    },
    {
        question: "216",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В 1714-1720 гг. главная цель царского правительства в строительстве военных крепостей по Иртышу:",
        options: [
            "блокирование нападения джунгар",
            "Защита казахской земли от Китая",
            "Постепенное завоевание территории Казахстана",
            "Развитие городской культуры в казахстанском регионе",
            "Защита от среднеазиатского вторжения",
        ],
        correctAnswer: 2
    },
    {
        question: "217",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Указ Российского Сената от 20 мая 1742 г.",
        options: [
            "О запрете казахам перегонять скот на правый берег Жайыка",
            "О строительстве военных крепостей в Средней сотне",
            "О защите казахов и крепостей в приграничье",
            "Укрепление Айшуак Султан как хана Младшего Жуза",
            "Укрепление Жанторе Султана как хана Младшего Жуза",
        ],
        correctAnswer: 2
    },
    {
        question: "218",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "50-годы XVIII в. длина этой линии в Северо-Восточном Казахстане составляет 723 версты:",
        options: [
            "Горькая линия",
            "Иртышская линия",
            "Колыванская линия",
            "линия Оринбор",
            "линия Омбы",
        ],
        correctAnswer: 2
    },
    {
        question: "219",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Известные центры казахско-российской торговли во II половине XVIII века:",
        options: [
            "Семипалатинск, Устькемен, Буктарма",
            "Петропавловск, Орынбор, Куля",
            "Семей, Петропавловск, Аксу",
            "Ташкент, Бухар, Самарканд",
            "Оринбор, Жамиш, Тобыл",
        ],
        correctAnswer: 2
    },
    {
        question: "220",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Период расширения казахстанско-российских торговых отношений:",
        options: [
            "30-ые гг. XVIII в.",
            "30-ые гг. XVIII в.",
            "30-ые гг. XVIII в.",
            "60-ые гг. XVIII в.",
            "70-ые гг. XVIII в.",
        ],
        correctAnswer: 3
    },
    {
        question: "221",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Причина письма Абильмамбет-хана Екатерине II в 1766 г.:",
        options: [
            "Получение разрешения на строительство караванных ангаров в крепостях",
            "Получение разрешения для специальных органов таможенного контроля",
            "Получение разрешения на прием караванов, проходящих через Туркестан в крепостях Семипалатинского Джамиша без ограничений",
            "Получение разрешения на расширение обменных пунктов по требованию торговцев",
            "Получение разрешения на строительство мечетей в крепостях",
        ],
        correctAnswer: 2
    },
    {
        question: "222",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Основные русские товары, удовлетворяющие повседневные потребности кочевников:",
        options: [
            "Чугунный горшок, сахар, шуга",
            "Алаша, хамка, фрукты-ягоды",
            "Животноводство, кожа, войлок",
            "Мебель, мед, одежда",
            "Оружие, инструменты",
        ],
        correctAnswer: 0
    },
    {
        question: "223",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В сентябре 1756 г. царская администрация установила официальный лимит на казахов младшего жуза:",
        options: [
            "Для реализации товаров иностранным купцам на казахской земле",
            "Пасти скот на берегу озера",
            "Строить мечети в крепостях",
            "Строительство торговых ресторанов",
            "казахи для установления экономических связей с соседними странами",
        ],
        correctAnswer: 1
    },
    {
        question: "224",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Этим летом впервые царская власть наложила ограничение на выпас казахов:",
        options: [
            "1756 г.",
            "1757 г.",
            "1758 г.",
            "1759 г.",
            "761 г.",
        ],
        correctAnswer: 0
    },
    {
        question: "225",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Царское правительство использовало этот фактор для колонизации плодородных земель Каспийского моря и Жайыкского района:",
        options: [
            "Покорность казахского народа",
            "Преобладание военной силы",
            "большое количество пустующих частей казахской земли",
            "Конфликт между Нуралы-ханом и батыр-султаном",
            "Бедственное положение казахов",
        ],
        correctAnswer: 3
    },
    {
        question: "226",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В 1766 году хан получил от царицы Екатерины разрешение на прием большого каравана, проходящего через Туркестан в крепостях Семипалатинск и Джамиш:",
        options: [
            "Абульпайиз",
            "Нуралы",
            "Абульмамбет",
            "Жолбарыс",
            "Кайып",
        ],
        correctAnswer: 2
    },
    {
        question: "227",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Причины, побудившие казахов Младшего жуза к участию в восстании Е. Пугачева:",
        options: [
            "вернуть  скот",
			"вернуть  земли",
			"вернуть власть",
			"выступить против Джунгар",
			"выступить против Китая",
        ],
        correctAnswer: 0
    },
    {
        question: "228",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Русский историк, написавший обстоятельный труд по истории казахов  первой половины ХІХ века:",
        options: [
            "Бартольд",
			"Даль",
			"Левшин",
			"Завалишин",
			"Вельяминов-Зернов",
        ],
        correctAnswer: 0
    },
    {
        question: "229",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Главный  итог восстания под предводительством Срыма Датулы:",
        options: [
            "казахи навсегда потеряли право кочевать между Волгой и Уралом",
			"казахам разрешалось переходить на правый берег Урала для кочевки",
			"резко усилилась колонизация края",
			"началось усиленное строительство военных упреплений",
			"еще более обострились отношения между Уральским казачеством и казахами",
        ],
        correctAnswer: 0
    },
    {
        question: "230",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Кюйши-композитор, классик казахской инструментальной музыки ХІХ века:",
        options: [
            "Даулеткерей Шыгай-улы",
            "Курмангазы Сагырбайулы",
            "Таттимбет Казангапулы",
            "Ықылас Дукенулы",
            "Жаяу Муса Байжан-улы",
        ],
        correctAnswer: 1
    },
    {
        question: "231",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В 1732-1734 годах часть родов  Среднего жуза приняла российское  подданство во главе с ханом:",
        options: [
            "Абулмамбетом",
            "Семеке",
            "Аблаем",
            "Болатом",
            "Вали",
        ],
        correctAnswer: 1
    },
    {
        question: "232",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Кюй  Курмангазы  «Кішкентай» посвящен:",
        options: [
            "Исатаю Тайманову",
            "Жанкожа Нұрмухамбетұлы",
            "Сырыму  Датову",
            "Кенесары Касымову",
            "Малайсары",
        ],
        correctAnswer: 0
    },
    {
        question: "233",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Присоединение  Казахстана к России длилось с:",
        options: [
            "1731 до 1864 гг.",
            "1731 до 1869 гг.",
            "1731 до 1870 гг.",
            "1731 до 1872 гг.",
            "1731 до 1873 гг.",
        ],
        correctAnswer: 0
    },
    {
        question: "234",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Не распространялась власть России к 1847 году:",
        options: [
            "на Прибалхашье",
            "на хребет Тарбагатая",
            "на Семиречье",
            "на юге Казахстана",
            "на полуостров Мангышлак",
        ],
        correctAnswer: 3
    },
    {
        question: "235",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Присоединение Казахстана к России завершилось в:",
        options: [
            "1852 г.",
            "1857 г.",
            "1860 г.",
            "1863 г.",
            "1864 г.",
        ],
        correctAnswer: 4
    },
    {
        question: "236",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Военные крепости России на юге и юго-востока Казахстана",
        options: [
            "Алатау, Капал, Сергиополь",
            "Талгар, Каскелен, Кастек",
            "Ак- мечеть,  Черняевка, Казалы",
            "Жулек, Жанакорган,Сарканд",
            "Кулан, Отрар, Туркестан",
        ],
        correctAnswer: 0
    },
    {
        question: "237",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Укрепление Верное весной 1854 года было заложено отрядом:",
        options: [
            "К.Гутковского",
            "С.Броневского",
            "М.Перемышельского",
            "В.Шубина",
            "Г.Гасфорта",
        ],
        correctAnswer: 2
    },
    {
        question: "238",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Учебные заведения  в крае царизмом создавались с целью:",
        options: [
            "дать достойное образование казахским детям",
            "подготовки военных специалистов",
            "подготовки переводчиков, писарей",
            "подготовки учителей для средних школ",
            "подготовки поступления в высшие учебные заведения",
        ],
        correctAnswer: 4
    },
    {
        question: "239",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Причины участия казахов Младшего жуза в  восстании  Е. Пугачева:",
        options: [
            "вернуть  скот",
			"вернуть  земли",
            "вернуть власть",
			"выступить против Джунгар",
			"выступить в союзе с Китаем против джунгар",
        ],
        correctAnswer: 0
    },
    {
        question: "240",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Царский указ 1756 г. запрещал казахам перегонять скот на территорию:",
        options: [
            "левобережье Акбулака",
            "правого берега Урала",
            "на левую сторону р. Орь",
            "в бассейн р. Сакмары",
            "долину р. Киыл",
        ],
        correctAnswer: 1
    },
    {
        question: "241",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Начало освободительной борьбы казахов принято считать с восстания:",
        options: [
            "под предводительством Срыма Датова",
            "Исатая Тайманова и Махамбета Утемисова",
            "Кенесары Касымова",
            "Есета Котибарова",
            "Жанхожи Нурмухамедова",
        ],
        correctAnswer: 0
    },
    {
        question: "242",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Первая попытка отмены института Ханской власти  предпринята Россией:",
        options: [
            "Младшем жузе,1786 г.",
            "Среднем жузе, 1822 г.",
            "Устав об Оренбургских киргизах 1824 г.",
            "Букеевской Орде, 1845г.",
            "ходе реформы 1867-1868 гг.",
        ],
        correctAnswer: 0
    },
    {
        question: "243",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Губернатор, попытавшийся ликвидировать Ханскую власть в период восстания С.Датова:",
        options: [
            "Эссен",
            "Сперанский",
            "Игельстром",
            "Пеутлинг",
            "Перовский",
        ],
        correctAnswer: 2
    },
    {
        question: "244",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Согласно реформе Игельстрома:",
        options: [
            "территория Казахстана разделена на округа",
            "попытка ликвидировать ханскую власть в Младшем жузе",
            "образована внутренняя Орда",
            "казахам разрешалось переходить на правый берег Урала для кочевки",
			"началось усиленное строительство военных упреплений",
        ],
        correctAnswer: 1
    },
    {
        question: "245",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В 1791 г. ханом Младшего жуза избран:",
        options: [
            "Нуралы",
            "Айшуак",
            "Ералы",
            "Бокей",
            "Есим",
        ],
        correctAnswer: 2
    },
    {
        question: "246",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В начале Х1Х века согласно указу Павла І образовано:",
        options: [
            "Букеевское ханство",
            "Астраханский уезд",
            "Закаспийская область",
            "Мангыстауский пристав",
            "Мангышлакский  уезд",
        ],
        correctAnswer: 0
    },
    {
        question: "247",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Внутренняя орда образована:",
        options: [
            "1800 г.",
            "1801 г.",
            "1802 г.",
            "1803 г.",
            "1804 г.",
        ],
        correctAnswer: 1
    },
    {
        question: "248",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Ханская власть в Букеевской Орде упразднена:",
        options: [
            "1842 г.",
            "1843 г.",
            "1844 г.",
            "1845 г.",
            "1847 г.",
        ],
        correctAnswer: 3
    },
    {
        question: "249",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Первая Светская казахская школа  открыта при хане:",
        options: [
            "Бокее",
            "Жангире",
            "Шигае",
            "Нуралы",
            "Уали",
        ],
        correctAnswer: 1
    },
    {
        question: "250",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Территории Младшего жуза по реформе 1824 г. дано название:",
        options: [
            "область оренбургских киргизов",
            "область сибирских киргизов",
            "Туркестанское генерал- губернаторство",
            "Оренбургское генерал- губернаторство",
            "Западно – сибирское генерал – губернаторство",
        ],
        correctAnswer: 0
    },
	{
        question: "251",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "«Устав об Оренбургских киргизах»  разработан:",
        options: [
            "П.Эссеном",
            "Павлом 1",
            "М.Сперанским",
            "В.Перовским",
            "П.Горчаковым",
        ],
        correctAnswer: 0
    },
    {
        question: "252",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Территория Среднего жуза  согласно «Устава» 1822 г. разделена:",
        options: [
            "дистанция, город, кибитки",
            "уезд, край, деревня",
            "округ, волость, аул",
            "губерния, поселок, жуз",
            "область, район, село",
        ],
        correctAnswer: 2
    },
    {
        question: "253",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Должностные лица  по «Уставу» 1824 г. назначались:",
        options: [
            "Оренбургским генерал-губернатором",
            "Азиатским комитетом",
            "Российским императором",
            "Султанами-правителями",
            "Оренбургской пограничной комиссией",
        ],
        correctAnswer: 4
    },
    {
        question: "254",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Главная цель  устава «об Оренбургских киргизах»:",
        options: [
            "изменение налоговой системы в Букеевской Орде",
            "усиление колонизации  Среднего жуза",
            "отмена ханской власти в  Младшем жузе",
            "построение крепостей вдоль Иртыша",
            "соединение Сибирской и  Сырдарьинской военных линий",
        ],
        correctAnswer: 2
    },
    {
        question: "255",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "«Устав о Сибирских киргизах» принят:",
        options: [
            "1821 г.",
            "1822 г.",
            "1823 г.",
            "1824 г.",
            "1825 г.",
        ],
        correctAnswer: 1
    },
    {
        question: "256",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "«Устав об Оренбургских киргизах»  принят:",
        options: [
            "1821 г.",
            "1822 г.",
            "1823 г.",
            "1824 г.",
            "1825 г.",
        ],
        correctAnswer: 3
    },
    {
        question: "257",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Поэт, участник  восстания 1836-1838 гг.",
        options: [
            "Шернияз",
            "Жаяу Муса",
            "Биржан Сал",
            "Шоже",
            "Махамбет",
        ],
        correctAnswer: 4
    },
    {
        question: "258",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Действие Кенесары, изменившее ход восстания:",
        options: [
            "вторжение в Кыргизские земли",
            "столкновение с кокандским ханом",
            "подавление выступления шаруа род Жаппас",
            "нанесение ущерба торговым связям",
            "откочевка в Семиречья",
        ],
        correctAnswer: 0
    },
    {
        question: "259",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Кенесары Касымов провозглашен ханом:",
        options: [
            "1837 г.",
            "1838 г.",
            "1839 г.",
            "1840 г.",
            "1841 г.",
        ],
        correctAnswer: 4
    },
    {
        question: "260",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Антиколониальное восстание 1837-1847 гг. возглавил:",
        options: [
            "Жанхожа Нурмухамедов",
            "Есет Котибаров",
            "Кенесары Касымов",
            "Жоламан Тленшиев",
            "Срым Датов",
        ],
        correctAnswer: 2
    },
    {
        question: "261",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В восстании 1837-1847 гг. участвовали казахи:",
        options: [
            "Младшего жуза",
            "Среднего жуза",
            "трех жузов",
            "Центрального Казахстана",
            "Старшего жуза",
        ],
        correctAnswer: 2
    },
    {
        question: "262",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Кенесары Касымов ввел вместо суда биев:",
        options: [
            "пограничный",
            "имперский",
            "народный",
            "суд казиев",
            "ханский",
        ],
        correctAnswer: 4
    },
    {
        question: "263",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Восстание казахов низовьев Сырьдарьи ХІХв. возглавил:",
        options: [
            "Кенесары",
            "Наурызбай",
            "Жанхожа",
            "Жоламан",
            "Исатай",
        ],
        correctAnswer: 2
    },
    {
        question: "264",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Крепостное право в России отменено:",
        options: [
            "1859 г.",
            "1860 г.",
            "1861 г.",
            "1862 г.",
            "1863 г.",
        ],
        correctAnswer: 2
    },
    {
        question: "265",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "1867-1868 гг. Букеевская Орда вошла в состав губернаторства:",
        options: [
            "Западно-Сибирского",
            "Астраханской",
            "Оренбургского",
            "Закаспийского",
            "Туркестанского",
        ],
        correctAnswer: 1
    },
    {
        question: "266",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В Оренбургское генерал-губернаторство входили области:",
        options: [
            "Семиреченская и Сырдарьинская",
            "Акмолинская и Семипалатинская",
            "Уральская и  Тургайская",
            "Аулие-Атинская и Туркестанская",
            "Центральная и Восточная",
        ],
        correctAnswer: 2
    },
    {
        question: "267",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Центр Западно-Сибирского генерал-губернаторства:",
        options: [
            "Оренбург",
            "Омск",
			"Иркутск",
			"Семипалатинск",
            "Петропавловск",
        ],
        correctAnswer: 1
    },
    {
        question: "268",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "По реформе 1867-1868 гг. Акмолинская область входила в состав:",
        options: [
            "Степной окружной губернии",
            "Оренбургской Пограничной комиссии",
            "Западно-Сибирского генерал – губернаторства",
            "Туркестанского краевого земства",
            "Омского областного управления",
        ],
        correctAnswer: 2
    },
    {
        question: "269",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "По реформе 1867-1868 гг. от налогов освобождены:",
        options: [
            "баи",
            "бии",
            "муллы",
            "султаны",
            "батыры",
        ],
        correctAnswer: 3
    },
    {
        question: "270",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Казахские земли  объявлены  собственностью России:",
        options: [
            "Временным Положением 1867 г.",
            "Временным Положением 1868 г.",
            "Временными правилами 1868 г.",
            "Положением 1886 г.",
            "Положением 1891 г.",
        ],
        correctAnswer: 3
    },
    {
        question: "271",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Роль в торговле между Россией и Китаем в ХІХв. играли города:",
        options: [
            "Ташкент, Кангар, Кульджа",
            "Семипалатинск,Усть-Каменогорск, Акмолинск",
            "Верный, Тараз, Шымкент",
            "Оренбург, Омск, Астрахань",
            "Семипалатинск, Бухтарма, Петропавловск",
        ],
        correctAnswer: 4
    },
    {
        question: "272",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Депутат I и II Государственной думы, член  партии кадетов:",
        options: [
            "С.Сейфуллин",
            "М.Жумабаев",
            "А.Байтурсынов",
            "А.Букейханов",
            "К.Тогусов",
        ],
        correctAnswer: 3
    },
    {
        question: "273",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Роль  Алаш - Орды в истории Казахского народа и объективная оценка их деятельности  была представлена в монографии «Алаш һәм Алашорда»:",
        options: [
            "Сүлейменова Р.",
            "Нурпейсова К.",
            "Асылбекова М.",
            "Романова Ю.",
            "Койгелдиева М.",
        ],
        correctAnswer: 1
    },
    {
        question: "274",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В первую Государственную Думу начала ХХ в.  от Семипалатинских казахов был избран:",
        options: [
            "А.Букейханов",
            "Т.Нурекенов",
            "Б.Каратаев",
            "Ш.Косшыгулов",
            "А.Беремжанов",
        ],
        correctAnswer: 0
    },
    {
        question: "275",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Каркаралинская петиция выдвинута  в:",
        options: [
            "1904 г.",
            "1905 г.",
            "1906 г.",
            "1907 г.",
            "1908 г.",
        ],
        correctAnswer: 1
    },
    {
        question: "276",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Государства-члены «Троицы», участвующие в Первой мировой войне:",
        options: [
            "Германия, Австрия-Венгрия, Италия",
            "Англия, Франция, Россия",
            "Австрия-Венгрия, Франция, Италия",
            "Германия, Франция, Россия",
            "Германия, Австрия-Венгрия, Англия",
        ],
        correctAnswer: 0
    },
    {
        question: "277",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Председателем Туркестанского Национального Совета 1917 года является:",
        options: [
            "Тынышпаев Мухамеджан",
            "Мустафа Чокай",
            "Ермеков Алимжан",
            "Бабаев Юсуп",
            "Досмухамедов Джаханша",
        ],
        correctAnswer: 1
    },
    {
        question: "278",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Предводитель повстанческого движения 1916 года в Каркаралы:",
        options: [
            "Б. Ашекеев",
            "Ж. Мамбетов",
            "А. Джангильдин",
            "Н. Кротов",
            "Т. Бокин",
        ],
        correctAnswer: 1
    },
    {
        question: "279",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Поводом к началу Восстания 1916 года послужил Указ:",
        options: [
            "25 августа 1913 г.",
            "25 июля 1914 г.",
            "15 июня 1915 г.",
            "25 июня 1916 г.",
            "20 июня 1917 г.",
        ],
        correctAnswer: 3
    },
    {
        question: "280",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Ханом в Тургайской области в ходе восстания 1916 г. избран:",
        options: [
            "Нурлан Кияшев",
            "Абдулгафар Джанбосынов",
            "Узак  Саурыков",
            "Аккоз Кошанов",
            "Оспан Чонов",
        ],
        correctAnswer: 1
    },
    {
        question: "281",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Основные очаги восстания 1916 г.:",
        options: [
            "Тургай, Семипалатинск",
            "Уральск, Акмола",
            "Тургай, Жетысу",
            "Костанай, Оренбург",
            "Сырдария, Семипалатинск",
        ],
        correctAnswer: 2
    },
    {
        question: "282",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Произведение С. Муканова, описывающее национально-освободительное восстание 1916 года:",
        options: [
            "«Карткожа».",
            "«Ботагоз».",
            "«Килы заман».",
            "«Кулагер».",
            "«Куралай Сулу».",
        ],
        correctAnswer: 1
    },
    {
        question: "283",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Произведение М. Ауезова, описывающее национально-освободительное восстание 1916 года:",
        options: [
            "«Карткожа».",
            "«Ботагоз».",
            "«Килы заман».",
            "«Кулагер».",
            "«Куралай Сулу».",
        ],
        correctAnswer: null
    },
    {
        question: "284",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Руководитель восстания 1916 г. в Семиречье:",
        options: [
            "Х. Тохтамышев",
            "Б.Ашкеев",
            "М. Тунганчин",
            "А.Айтиев",
            "Н. Турекулов",
        ],
        correctAnswer: 1
    },
    {
        question: "285",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В результате Февральской революции установилась власть:",
        options: [
            "парламентская республика",
            "военная диктатура",
            "конституционная монархия",
            "двоевластие",
            "абсолютная монархия",
        ],
        correctAnswer: 3
    },
    {
        question: "286",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Комиссар временного правительства в Туркестане:",
        options: [
            "М.Тынышбаев",
            "А.Байтурсынов",
            "М.Чокай",
            "А.Букейханов",
            "Х.Досмухамедов",
        ],
        correctAnswer: 2
    },
    {
        question: "287",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Руководитель правительства Алаш-Орды:",
        options: [
            "А.Байтурсынов",
            "Ж. Аймаутулы",
            "А. Ермеков",
            "С.Ходжанов",
            "А.Букейханов",
        ],
        correctAnswer: 4
    },
    {
        question: "288",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Печатный орган партии «Алаш»:",
        options: [
            "«Уш - жуз»",
            "«Қазах»",
            "«Уран»",
            "«Дала уалаятының газеті»",
            "«Қазақстан»",
        ],
        correctAnswer: 1
    },
    {
        question: "289",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Позиция партии «Алаш» в отношении указа царя от 25 июня 1916 г.",
        options: [
            "поддержали",
            "выступили против",
            "призывали к открытой борьбе",
            "придерживались тактики разумного компромисса",
            "заняли выжидательную позицию",
        ],
        correctAnswer: 3
    },
    {
        question: "290",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Программа партии «Алаш» была опубликована в газете:",
        options: [
            "«Казах»",
            "«Серке»",
            "«Тіршілік»",
            "«Сары-Арка»",
            "«Енбекши казах»",
        ],
        correctAnswer: 0
    },
    {
        question: "291",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Основная задача партии «Алаш»:",
        options: [
            "образование казахской автономии",
            "добиться равноправия всех народов",
            "выход России из мировой войны",
            "выход из состава России",
            "решение национального вопроса",
        ],
        correctAnswer: 0
    },
    {
        question: "292",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Комиссаром Временного правительства Семиречья  назначен:",
        options: [
            "У.Исаев",
            "М.Тынышпаев",
			"М.Шокай",
            "М. Мурзагалиев",
			"Н. Нурмаков",
        ],
        correctAnswer: 1
    },
    {
        question: "293",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Комиссаром временного правительства Тургайской области:",
        options: [
            "А.Байтурсынов",
            "Ж. Акбаев",
            "Ж.Мынбаев",
            "А.Букейханов",
            "К. Жубанов",
        ],
        correctAnswer: 3
    },
    {
        question: "294",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В каком году была основана партия Алаш:",
        options: [
            "1917 г.",
            "1910 г.",
            "1916 г.",
            "1918 г.",
            "1911 г.",
        ],
        correctAnswer: 0
    },
    {
        question: "295",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Алаш-Орда ликвидирована:",
        options: [
            "1919 г.",
            "1920 г.",
            "1921 г.",
            "1922 г.",
            "1923 г.",
        ],
        correctAnswer: 1
    },
    {
        question: "296",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Первый руководитель партии «Уш-жуз»:",
        options: [
            "М. Каратаев",
            "Х.Досмухамедов",
            "Ж.Досмухамедов",
            "М.Айтпенов",
            "К.Тогусов",
        ],
        correctAnswer: 3
    },
    {
        question: "297",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Автор книги «Оян, қазақ»:",
        options: [
            "М.Дулатов",
            "С.Сейфуллин",
            "И.Жансугуров",
            "С.Торайгыров",
            "Б. Майлин",
        ],
        correctAnswer: 0
    },
    {
        question: "298",
		options: [
        ],
        correctAnswer: null
    },
    {
        question: "Редактор журнала «Айкап»:",
        options: [
            "Ж.Сейдалин",
            "М.Сералин",
            "Б.Каратаев",
            "С.Торайгыров",
            "Б.Майлин",
        ],
        correctAnswer: 1
    },
    {
        question: "299",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Ученый, лингвист, просветитель, редактор газеты «казах»:",
        options: [
            "Жумабаев М.",
            "Аймауытов Ж.",
            "Дулатов М.",
            "Асфендияров С.",
            "Байтурсынов А.",
        ],
        correctAnswer: 4
    },
    {
        question: "300",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Реформатор казахского алфавита:",
        options: [
            "Байтурсынов А.",
            "Кунанбаев А.",
            "Букейханов А.",
            "Кудайбердиев Ш.",
            "Алтынсарин И.",
        ],
        correctAnswer: 0
    },
    {
        question: "301",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "К 1917 г.в пользу переселенцев   изъято  десятин земли:",
        options: [
            "4 млн.",
            "20 млн.",
            "45 млн.",
            "25 млн.",
            "50 млн.",
        ],
        correctAnswer: 2
    },
    {
        question: "302",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Самодержавие свергнуто в России:",
        options: [
            "27 февраля 1917 г.",
            "27 ноября 1917 г.",
            "25 октября 1917 г.",
            "25 ноября 1917 г.",
            "27 декабря 1917 г",
        ],
        correctAnswer: 0
    },
    {
        question: "303",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Установление Советской власти в Казахстане:",
        options: [
            "октябрь 1917 г. до марта 1918 г.",
            "ноябрь 1919 г. до декабря 1920 г.",
            "декабрь 1920 г. до января 1921 г.",
            "январь 1922 г. до февраля 1923 г.",
            "февраль 1924 г. до марта 1925 г.",
        ],
        correctAnswer: 0
    },
    {
        question: "304",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Советская власть в Букеевской Орде установлена:",
        options: [
            "октябре 1917 г.",
            "ноябре 1917 г.",
            "декабре 1917 г.",
            "январе 1918 г.",
            "феврале 1918 г.",
        ],
        correctAnswer: 2
    },
    {
        question: "305",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Советская власть впервые в Казахстане установлена:",
        options: [
            "Верном",
            "Казалинске",
            "Перовске",
            "Актюбинске",
            "Ак-Мечети",
        ],
        correctAnswer: 2
    },
    {
        question: "306",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Политический оппонент Советской власти в Казахстане:",
        options: [
            "Уш-жуз",
            "Шура –и-Ислами",
            "Алаш",
            "Шура-и- Улема",
            "Кадеты",
        ],
        correctAnswer: 2
    },
    {
        question: "307",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В Казахстане  ликвидирован  последний фронт  гражданской войны:",
        options: [
            "Актюбинский",
            "Восточный",
            "Уральский",
            "Туркестанский",
            "Северный Семиреченский",
        ],
        correctAnswer: 4
    },
    {
        question: "308",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Основной элемент политики «Военного коммунизма»:",
        options: [
            "введение продовольственной разверстки",
            "укрепление связей между городом и деревней",
            "прямой продуктообмен",
            "увеличение производства сельскохозяйственной продукции",
            "развитие кооперации",
        ],
        correctAnswer: 3
    },
    {
        question: "309",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Продовольственная разверстка введена в годы:",
        options: [
            "октябрьского переворота",
            "гражданской войны",
            "коллективизации",
            "индустриализации",
            "нэпа",
        ],
        correctAnswer: 1
    },
    {
        question: "310",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Главная функция Кирревкома:",
        options: [
            "борьба с контрреволюцией",
            "организация хлебозаготовок",
            "подготовка и создание казахской автономии",
            "распространение идей социализма",
            "ликвидация неграмотности",
        ],
        correctAnswer: 2
    },
    {
        question: "311",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Казахская Советская государственность образована:",
        options: [
            "апреле 1919 г.",
            "августа 1920 г.",
            "июне 1921 г.",
            "сентябрь 1922 г.",
            "октябрь 1923 г.",
        ],
        correctAnswer: 1
    },
    {
        question: "312",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Столица КазАССР в 1920-1924 гг.:",
        options: [
            "Ташкент",
            "Оренбург",
            "Уральск",
            "Семипалатинск",
            "Алма-Ата",
        ],
        correctAnswer: 1
    },
    {
        question: "313",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "КазАССР была в составе союзной республики:",
        options: [
            "Узбекской",
            "Украинской",
            "Грузинской",
            "Российской",
            "Белорусской",
        ],
        correctAnswer: 3
    },
    {
        question: "314",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Образование КазАССР получила законодательное оформление на учредительном съезде советов  в:",
        options: [
            "Оренбурге,1920 г.",
            "Ташкенте,1921 г.",
            "Актюбинске,1922 г.",
            "Алматы,1924 г.",
            "Кзыл-Орде,1925 г.",
        ],
        correctAnswer: 0
    },
    {
        question: "315",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Центральный избирательный комитет КазАССР возглавил:",
        options: [
            "А.Джангильдин",
            "Б.Каратаев",
            "С.Мендешев",
            "А.Айтиев",
            "Г.Алибеков",
        ],
        correctAnswer: 2
    },
    {
        question: "316",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "При коллективизации в Казахстане",
        options: [
            "улучшенная демография",
            "начался переход в кочевое хозяйство",
            "кочевники встречали с энтузиазмом",
            "был принят Декрет «о конфискации скота»",
            "способствовал мобилизации сельских тружеников",
        ],
        correctAnswer: 3
    },
    {
        question: "317",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Термин, раскрывающий сущность политики «военного коммунизма»:",
        options: [
            "продовольственная разверстка",
            "продовольственный налог",
            "конфискация бай-кулаков",
            "репрессии",
            "аренда земли",
        ],
        correctAnswer: 0
    },
    {
        question: "318",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Вторая столица КазАССР:",
        options: [
            "Алматы",
            "Семипалатинск",
            "Кызыл-Орда",
            "Оренбург",
            "Омск",
        ],
        correctAnswer: 2
    },
    {
        question: "319",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Киргизская АССР переименована в Казахскую АССР:",
        options: [
            "1920 г.",
            "1921г.",
            "1923 г.",
            "1924 г.",
            "1925 г.",
        ],
        correctAnswer: 4
    },
    {
        question: "320",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Национально-территориальное размежевание республик Средней Азии произошло в:",
        options: [
            "1921 г.",
            "1922 г.",
            "1923 г.",
            "1924 г.",
            "1925 г.",
        ],
        correctAnswer: 3
    },
    {
        question: "321",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Верный переименован в Алма-Ату:",
        options: [
            "1919 г.",
            "1920 г.",
            "1921 г.",
            "1922 г.",
            "1923 г.",
        ],
        correctAnswer: 2
    },
    {
        question: "322",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "СССР образован:",
        options: [
            "1920 г.",
            "1921 г.",
            "1922 г.",
            "1923 г.",
            "1924 г.",
        ],
        correctAnswer: 2
    },
    {
        question: "323",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Земельно-водная реформа в Казахстане проведена в:",
        options: [
            "1920-1921 гг.",
            "1921-1922 гг.",
            "1922-1923 гг.",
            "1923-1924 гг.",
            "1924-1925 гг.",
        ],
        correctAnswer: 1
    },
    {
        question: "324",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Суть земельно-водной реформы:",
        options: [
            "оседание кочевых хозяйств",
            "развитие поливного земледелия",
            "возврат земель, изъятых за годы колонизации",
            "передел пастбищных угодий",
            "развитие оросительной системы",
        ],
        correctAnswer: 2
    },
    {
        question: "325",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Решение о переходе  к новой экономической политике:",
        options: [
            "апреле 1920 г.",
            "марте 1921 г.",
            "феврале 1922 г.",
            "январе 1923 г.",
            "декабре 1924 г.",
        ],
        correctAnswer: 1
    },
    {
        question: "326",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Новая экономическая политика:",
        options: [
            "свертывание товарно-денежных отношений",
            "бесплатные коммунальные услуги",
            "всеобщая трудовая повинность",
            "замена продразверстки продналогом",
            "централизованное распределение продовольствия",
        ],
        correctAnswer: 3
    },
    {
        question: "327",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Индустриализация осуществлялась за счет:",
        options: [
            "внешних займов",
            "легкой промышленности",
            "иностранных инвестиций",
            "сельского хозяйства",
            "национальных окраин",
        ],
        correctAnswer: 3
    },
    {
        question: "328",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Против превращения Казахстана в сырьевую  базу выступил:",
        options: [
            "Исаев У.",
            "Букейханов А.",
            "Голощекин Ф.",
            "Садвокасов С.",
            "Тынышпаев М.",
        ],
        correctAnswer: 3
    },
    {
        question: "329",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Строительство Туркестано-Сибирской железной дороги началось:",
        options: [
            "1925 г.",
            "1926 г.",
            "1927 г.",
            "1928 г.",
            "1929 г.",
        ],
        correctAnswer: 2
    },
    {
        question: "330",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Строительство Туркестано-Сибирской железной завершено:",
        options: [
            "1928 г.",
            "1929 г.",
            "1930 г.",
            "1931 г.",
            "1932 г.",
        ],
        correctAnswer: null
    },
    {
        question: "331",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В 1928 г. в Казахстане  введено административно-территориальное деление:",
        options: [
            "аул-село-район-губерния-центр",
            "аул,село-район-округ-центр",
            "аул, село-уезд-округ-центр",
            "волость-уезд-губерния-центр",
            "аул, село-волость-уезд-губерния-центр",
        ],
        correctAnswer: 1
    },
    {
        question: "332",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Форма колхозного строительства в коллективизации:",
        options: [
            "коммуна",
			"сельскохозяйственная артель",
            "тозы",
            "совхозы",
            "кооперация",
        ],
        correctAnswer: 0
    },
    {
        question: "333",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В годы коллективизации от голода погибло:",
        options: [
            "1 млн. человек",
            "1,5 млн. человек",
            "2,1 млн. человек",
            "2,5 млн. человек",
            "3,3 млн. человек",
        ],
        correctAnswer: 2
    },
    {
        question: "334",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Поголовье скота в Казахстане накануне коллективизации  в республике  составляло:",
        options: [
            "40,5 млн. голов",
            "41 млн. голов",
            "41,5 млн. голов",
            "42 млн. голов",
            "42,5 млн. голов",
        ],
        correctAnswer: 0
    },
    {
        question: "335",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "К 1933 г. в Казахстане поголовье скота сократилось до:",
        options: [
            "3,8 млн.",
            "4,5 млн.",
            "4,8 млн.",
            "5,1 млн.",
            "5,3 млн.",
        ],
        correctAnswer: 1
    },
    {
        question: "336",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В годы коллективизации из Казахстана эмигрировало человек:",
        options: [
            "1 млн.",
            "1,2 млн.",
            "1,5 млн.",
            "1,7 млн.",
            "1,9 млн.",
        ],
        correctAnswer: 0
    },
    {
        question: "337",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Декрет о конфискации крупных байских хозяйств и феодалов издан:",
        options: [
            "в 1924 г.",
            "в 1925 г.",
            "в 1926 г.",
            "в 1927 г.",
            "в 1928 г.",
        ],
        correctAnswer: 4
    },
    {
        question: "338",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Политические лагеря построенные в 1930 годах:",
        options: [
            "Алжир, Карлаг.",
            "Семипалатинск, Сункар.",
            "Қарталы, Барлау.",
            "Эмба, Уральск.",
            "Кубань, Отрар.",
        ],
        correctAnswer: 0
    },
    {
        question: "339",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В 1937г. на территорию Казахстана депортированы:",
        options: [
            "немцы",
            "турки-месхетинцы",
            "чеченцы",
            "карачаевцы",
            "корейцы",
        ],
        correctAnswer: 4
    },
    {
        question: "340",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Статус союзной республики Казахстан получил:",
        options: [
            "1932 г.",
            "1933 г.",
            "1934 г.",
            "1935 г.",
            "1936 г.",
        ],
        correctAnswer: 4
    },
    {
        question: "341",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Алма-Атинский медицинский институт образован:",
        options: [
            "1930 г",
            "1931 г.",
            "1932 г.",
            "1933 г.",
            "1934 г.",
        ],
        correctAnswer: 1
    },
    {
        question: "342",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Ректор медицинского института С.Д. Асфендияров репрессирован:",
        options: [
            "1935 г.",
            "1936 г.",
            "1937 г.",
            "1938 г.",
            "1939 г.",
        ],
        correctAnswer: 3
    },
    {
        question: "343",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Автор книги «история Казахстана с древнейших времен до наших дней»:",
        options: [
            "М.Тынышпаев",
            "С.Асфендияров",
            "М.Ауэзов",
            "М.Шокай",
            "А.Байтурсынов",
        ],
        correctAnswer: 1
    },
    {
        question: "344",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Первая пьеса, поставленная казахским национальным театром:",
        options: [
            "«Шаншар- молда»",
            "«Ревизор»",
            "«Аркалык – батыр»",
            "«Отелло»",
            "«Енлик-Кебек»",
        ],
        correctAnswer: 4
    },
    {
        question: "345",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Ученый, исследовавший казахское музыкальное искусство:",
        options: [
            "А. Кастанье",
            "Г. Потанин",
            "А. Затаевич",
            "А.Эйхгорн",
            "С. Рыбаков",
        ],
        correctAnswer: 2
    },
    {
        question: "346",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В 1938 г. киностудии «Ленфильм» был снят первый звуковой фильм:",
        options: [
            "Енлик-Кебек",
            "Кыз-Жибек",
            "Амангельды",
            "Айман-Шолпан",
            "За Родину",
        ],
        correctAnswer: 2
    },
    {
        question: "347",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Оркестр им. Курмангазы создан:",
        options: [
            "1925 г.",
            "1927 г.",
            "1930 г.",
            "1934 г.",
            "1939 г.",
        ],
        correctAnswer: 3
    },
    {
        question: "348",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В предвоенные годы Казахстан занимал первое место по добыче:",
        options: [
            "нефти",
            "угля",
            "свинца",
            "меди",
            "марганца",
        ],
        correctAnswer: 2
    },
    {
        question: "349",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Наука и культура в годы ВОВ:",
        options: [
            "А. Бек написал повесть о подвиге Т. Тохтарова",
            "автор повести «Солдат из Казахстана» С. Муканов",
            "в Алма-Ату прибыли более 20 научных учреждений",
            "около 80 писателей и поэтов сражались на фронтах войны",
            "И. Губкин удостоен Государственной премии в 1942 г.",
        ],
        correctAnswer: 2
    },
    {
        question: "350",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "23 августа 1939 г. между  СССР и Германией  подписан:",
        options: [
            "пакт о ненападении",
            "соглашение о нейтралитете",
            "договор о городах - побратимах",
            "меморандум  о заключении  военного союза",
            "рескрипт  об использовании трансграничных рек",
        ],
        correctAnswer: 0
    },
    {
        question: "351",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "По «плану Барбаросса» намечалось:",
        options: [
            "образовать плацдарм военных действий",
            "утвердить господство в Юго-Восточной Азии",
            "включить в состав Рейха страны Ближнего Востока",
            "создать марионеточного государства в Центральной Азии",
            "обеспечить «жизненное пространство» на Востоке за счет уничтожения  СССР",
        ],
        correctAnswer: 4
    },
    {
        question: "352",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Экономика Казахстана в годы ВОВ:",
        options: [
            "Казахстан стал сырьевой базой  страны",
            "В 40-е гг. СССР стал зависим от импорта цветных металлов",
            "Слабо шел процесс урбанизации",
            "Недостаточно использовался труд спецпереселенцев  и политзаключенных",
            "в 1942 г. началось движение женщин за овладение мужскими профессиями",
        ],
        correctAnswer: 0
    },
    {
        question: "353",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Предприятия, эвакуированные в годы войны из западных областей СССР,  размещены в городе:",
        options: [
            "Шымкенте",
            "Аркалыке",
            "Павлодаре",
            "Акмоле",
            "Кзыл-Орде",
        ],
        correctAnswer: 0
    },
    {
        question: "354",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Герой Советского Союза Нуркен Абдиров был:",
        options: [
            "Пехотинцем",
            "Артиллеристом",
            "Танкистом",
            "Летчиком",
            "Разведчиком",
        ],
        correctAnswer: 3
    },
    {
        question: "355",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "316-я стрелковая дивизия переформирована в дивизию, награжденную орденом Красного Знамени за проявленную храбрость в бою под Москвой:",
        options: [
            "314-я стрелковая дивизия",
            "101 - дивизия",
            "8-я гвардейская дивизия",
            "24-я стрелковая бригада",
            "69-я дивизия",
        ],
        correctAnswer: 2
    },
    {
        question: "356",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "316-й стрелковой дивизии присвоено наименование по желанию бойцов:",
        options: [
            "Дивизия имени Б. Момышулы",
            "пехотная дивизия",
            "Волоколамская дивизия",
            "дивизия В.И. Панфилова",
            "кавалерия",
        ],
        correctAnswer: 3
    },
    {
        question: "357",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "За проявленное мужество в боях под Москвой присвоено звание Героя Советского Союза:",
        options: [
            "М. Габдуллин",
            "К. Шакенов",
            "С. Джаксыгулов",
            "Д. Шыныбеков",
            "Г. А. Эрин",
        ],
        correctAnswer: 0
    },
    {
        question: "358",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "За штурм штаба немецкой дивизии в деревне Бородино и убийство 5 немецких офицеров присвоено звание Героя Советского Союза:",
        options: [
            "А. Петров",
            "Б. Момышулы",
            "Т. Токтаров",
            "К. Кайсенов",
            "Е.Кайсенов",
        ],
        correctAnswer: 2
    },
    {
        question: "359",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Автор работы «Казахстан – арсенал фронта», внесший большой вклад в историю Казахстана:",
        options: [
            "Аманжолова Д.А.",
            "Нурпеисов К.Н.",
            "Койгельдиев М.К.",
            "Козыбаев М.К.",
            "Бекмаханов Е.",
        ],
        correctAnswer: null
    },
    {
        question: "360",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Из Алматннского Государственного медицинского университета в первые дни  Великой  Отечественной войны на фронт ушли:",
        options: [
            "75 преподавателей - 205 студентов",
            "79 преподавателей - 236 студентов",
            "84 преподавателя - 282 студента",
            "89 преподавателя - 276 студентов",
            "93 преподавателя - 301 студент",
        ],
        correctAnswer: 2
    },
    {
        question: "361",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Алия Молдагулова на фронте была:",
        options: [
            "Разведчицей.",
            "Пулеметчицей.",
            "Радисткой.",
            "Снайпером.",
            "Медсестрой.",
        ],
        correctAnswer: 3
    },
    {
        question: "362",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Маншук Маметова совершила героический подвиг:",
        options: [
            "при обороне Малоярославца",
            "на Курской дуге",
            "в защите Ленинграда",
            "под Невелем",
            "в освобождении г. Алексина",
        ],
        correctAnswer: 3
    },
    {
        question: "363",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В годы ВОВ  Указом Президиума Верховного совета СССР в бассейне Каспия введено военное положение:",
        options: [
            "Осенью 1941 г.",
            "Летом 1942 г.",
            "Осенью 1942 г.",
            "Зимой 1942 г.",
            "Весной 1943 г.",
        ],
        correctAnswer: 2
    },
    {
        question: "364",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В сентябре 1942 г. объявлено военное положение в городах:",
        options: [
            "Кзыл-Орда",
            "Гурьеве, Уральске",
            "Семипалатинске, Усть-Каменогорске",
            "Петропавловске, Кустанае",
            "Чимкенте, Алма-ате",
        ],
        correctAnswer: 1
    },
    {
        question: "365",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "По планам фашистов Казахстан должен был войти в колонию под названием:",
        options: [
            "Ист-Азия.",
            "Ост Европа",
            "Грос Туркестан.",
            "Московия.",
            "Ост-Азия.",
        ],
        correctAnswer: 2
    },
    {
        question: "366",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Воин-казахстанец, закрывший вражеский дзот в годы ВОВ:",
        options: [
            "Боран Нысанбаев",
            "Тастемир Рустемов",
            "Александр Васильев",
            "Агадил Сухамбаев",
            "Карсыбай Спатаев",
        ],
        correctAnswer: 1
    },
    {
        question: "367",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В боях за Днепр самый юный Герой Советского Союза:",
        options: [
            "С. Нурмагамбетов",
            "Н. Сьянов",
            "Х. Кайдаулов",
            "Ж. Елеусов",
            "З. Турарбеков",
        ],
        correctAnswer: 3
    },
    {
        question: "368",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Вторая Мировая война закончилась:",
        options: [
            "2 мая 1945 г.",
            "9 мая 1945 г.",
            "1 августа 1945 г.",
            "2 сентября 1945 г.",
            "1 октября 1945 г.",
        ],
        correctAnswer: 3
    },
    {
        question: "369",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Крупное достижение в послевоенные годы в области литературы:",
        options: [
            "«Миллионер»",
            "«Путь Абая»",
            "«Кочевники»",
            "«Ботагоз»",
            "«Письма солдата»",
        ],
        correctAnswer: 1
    },
    {
        question: "370",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Карточная  система распределения продовольственных  и промышленных товаров  была отменена:",
        options: [
            "1946 г.",
            "1947 г.",
            "1948 г.",
            "1949 г.",
            "1950 г.",
        ],
        correctAnswer: 1
    },
    {
        question: "371",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Первое испытание ядерного заряда на Семипалатинском полигоне было произведено в:",
        options: [
            "1948 году",
            "1949 году",
            "1947 году",
            "1946 году",
            "1950 году",
        ],
        correctAnswer: 1
    },
    {
        question: "372",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Предприятие, которое вошло в строй в первое послевоенное десятилетие:",
        options: [
            "Усть-Каменогорский  свинцово- цинковый комбинат.",
            "Карагандинский металлургический комбинат.",
            "Балхашский медеплавильный комбинат.",
            "Чимкентский свинцовый завод.",
            "Джамбулский сахарный завод.",
        ],
        correctAnswer: 2
    },
    {
        question: "373",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Для освоения целинных и залежных земель в Казахстане из европейской части СССР  прибыло:",
        options: [
            "1,5 млн. человек",
            "2 млн. человек",
            "2,5 млн. человек",
            "2,7 млн.человек",
            "3 млн. человек",
        ],
        correctAnswer: 1
    },
    {
        question: "374",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Освоение целинных земель в Казахстане началось в:",
        options: [
            "1951 году.",
            "1955 году.",
            "1952 году.",
            "1953 году.",
            "1954 году.",
        ],
        correctAnswer: 4
    },
    {
        question: "375",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Укажите период, получивший название «хрущевской оттепели»:",
        options: [
            "конец 40-х гг.",
            "первая половина 50-х гг.",
            "вторая половина 50-х гг.",
            "середина 60-х гг.",
            "начало 70-х гг.",
        ],
        correctAnswer: 2
    },
    {
        question: "376",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Автор книг «Шыганақ», «Миллионер», «Караганда»:",
        options: [
            "Г. Жубанова",
            "А. Бокейханов",
            "К. Сатбаев",
            "Б. Бекмаханов",
            "Г. Мустафин",
        ],
        correctAnswer: 4
    },
    {
        question: "377",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Академия наук КазССР была образована",
        options: [
            "1946 г.",
            "1945 г.",
            "1944 г.",
            "1956 г.",
            "1896 г.",
        ],
        correctAnswer: 0
    },
    {
        question: "378",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Первый президент Академии Наук КазССР:",
        options: [
            "К. Казибаев",
            "О. Сулейменов",
            "С. Садвакасов",
            "К. Сатпаев",
            "Е. Бекмаханов",
        ],
        correctAnswer: 3
    },
    {
        question: "379",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Первая телефонная станция в Казахстане открылось:",
        options: [
            "в 1946 г.",
            "в 1947 г.",
            "в 1949 г.",
            "в 1948 г.",
            "в 1950 г.",
        ],
        correctAnswer: 2
    },
    {
        question: "380",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Идейным вдохновителем и руководителем организации «Жас тулпар», созданной в 60-е годы в Москве казахской молодежью был:",
        options: [
            "Жумадилов Б.",
            "Шаханов М.",
            "Мусрепов Г.",
            "Сулейменов О.",
            "Ауэзов М.",
        ],
        correctAnswer: 4
    },
    {
        question: "381",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Впервые колхозники получили право на пенсию:",
        options: [
            "1960 г.",
            "1961 г.",
            "1962 г.",
            "1963 г.",
            "1964 г.",
        ],
        correctAnswer: 4
    },
    {
        question: "382",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Акмолинск переименован в Целиноград:",
        options: [
            "1959 г.",
            "1960 г.",
            "1961 г.",
            "1962 г.",
            "1963 г.",
        ],
        correctAnswer: 2
    },
    {
        question: "383",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Культ  личности  Сталина разоблачен:",
        options: [
            "в 1953 г.",
            "в 1954 г.",
            "в 1955 г.",
            "в 1956 г.",
            "в 1957 г.",
        ],
        correctAnswer: 3
    },
    {
        question: "384",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Разоблачение   культа  личности  Сталина:",
        options: [
            "в октябре 1953 года",
            "осужден на ХІХ съезде КПСС",
            "с докладом выступил В. Молотов",
            "получил в истории как период «оттепеля»",
            "отставка Н.С. Хрущева",
        ],
        correctAnswer: 3
    },
    {
        question: "385",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Процесс изменивший языковую и демографическую ситуацию в Казахстане в середине 50-годов ХХ века:",
        options: [
            "освоение целинных и залежных земель",
            "милитаризация",
            "открытие специализированных средних учебных заведений",
            "строительство промышленных объектов",
            "урбанизация",
        ],
        correctAnswer: 0
    },
    {
        question: "386",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Появление новых городов в Казахстане в 60-е гг. ХХ в. связано:",
        options: [
            "оттоком сельского населения в города",
            "миграционной политикой",
            "развитием инфраструктуры",
            "демографической политикой",
            "освоением месторождений полезных ископаемых",
        ],
        correctAnswer: 4
    },
    {
        question: "387",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В какие годы по инициативе Хрущева был упразднен ГУЛАГ:",
        options: [
            "1950-1956 гг.",
            "1953-1956 гг.",
            "1955-1957 гг.",
            "1958-1960 гг.",
            "1953-1955 гг.",
        ],
        correctAnswer: 1
    },
    {
        question: "388",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Кунаев Д.А. руководил КазССР:",
        options: [
            "1955 -1960 годы.",
            "1962-1964 годы.",
            "1964 - 1973 годы.",
            "1964-1986 годы.",
            "1974-1987 годы.",
        ],
        correctAnswer: 2
    },
    {
        question: "389",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В какие годы велась разработка целинных и залежных земель:",
        options: [
            "1954-1960 гг.",
            "1955-1956 гг.",
            "1959-1962 гг.",
            "1948-1950 гг.",
            "1957-1960 гг.",
        ],
        correctAnswer: 0
    },
    {
        question: "390",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В каких регионах Казахстана началось освоение земель:",
        options: [
            "Центральный Казахстан",
            "Западный Казахстан",
            "Восточный Казахстан",
            "Северный Казахстан",
            "Южный Казахстан",
        ],
        correctAnswer: 3
    },
    {
        question: "391",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Площадь земель, подвергшихся эрозии к 1960-м годам:",
        options: [
            "9 млн га",
            "10 мл га",
            "7 млн ​​га",
            "7,5 млн га",
            "8 млн га",
        ],
        correctAnswer: 0
    },
    {
        question: "392",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В начале 1960 года оралманы вернулись в Казахстан из государства и в каком количестве:",
        options: [
            "100 тысяч человек из Ирана;",
            "150 тысяч человек из Афганистана;",
            "200 тыс. человек из Китая;",
            "200 тысяч человек из Монголии;",
            "50 тысяч человек из Турции.",
        ],
        correctAnswer: 2
    },
    {
        question: "393",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В феврале-марте 1954 г. на пленуме ЦК КПСС обсуждался вопрос о:",
        options: [
            "об укреплении колхозов.",
            "о роспуске созданных колхозов.",
            "об освоении целинных и залежных земель.",
            "о преобразовании колхозов в совхозы.",
            "о роспуске МТС.",
        ],
        correctAnswer: 2
    },
    {
        question: "394",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В Казахстане с 1954 по 1986 годы было закрыто более:",
        options: [
            "800 школ с казахским языком обучения.",
            "500 школ с казахским языком обучения.",
            "700 школ с казахским языком обучения.",
            "600 школ с казахским языком обучения.",
            "1000 школ с казахским языком обучения.",
        ],
        correctAnswer: 2
    },
    {
        question: "395",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В результате подписания договора о запрещении ядерных испытаний в атмосфере, космосе и под водой 5 августа 1963 года:",
        options: [
            "Закрыли Семипалатинский ядерный полигон.",
            "Перешли к подземным испытаниям в Семипалатинском полигоне.",
            "Преступили к реконструкцию полигона.",
            "Прекращены испытания на ядерном полигоне в Семипалатинске.",
            "Введен временный мораторий на все испытания в Семипалатинском полигоне.",
        ],
        correctAnswer: 4
    },
    {
        question: "396",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Годы правления Л.И. Брежнева:",
        options: [
            "1964-1982 гг.",
            "1953-1964 гг.",
            "1983-1985 гг.",
            "1985-1990 гг.",
            "1952-1954 гг.",
        ],
        correctAnswer: 0
    },
    {
        question: "397",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "По Конституции СССР 1977 года Советский Союз провозгласил  о переходе к следующему этапу:",
        options: [
            "Развитой социализм",
            "Утопический социализм",
            "Социализм победил окончательно",
            "Социализм окончательно и бесповоротно победил",
            "Первая фаза коммунизма",
        ],
        correctAnswer: 0
    },
    {
        question: "398",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В 1972 г. была построена электростанция:",
        options: [
            "на Или",
            "в Алматы",
            "в Джамбуле",
            "на Капчагае",
            "на Есиле",
        ],
        correctAnswer: 3
    },
    {
        question: "399",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Спортивный комплекс «Медеу» был сдан в эксплуатацию:",
        options: [
            "11 февраля 1973 г.",
            "10 марта 1970 г.",
            "31 января 1972 г.",
            "22 февраля 1973 г.",
            "12 марта 1973 г.",
        ],
        correctAnswer: 2
    },
    {
        question: "400",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Общественный деятель, возглавивший в 80-х годах ХХ-го века Комитет по проблемам Балхаша и Арала:",
        options: [
            "О. Сулейменов",
            "М. Шаханов",
            "М. Оспанов",
            "А. Терещенко",
            "Х. Кожахмедов",
        ],
        correctAnswer: 1
    },
    {
        question: "401",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Экологическое движение под руководством О. Сулейменова в 80-е годы XX века:",
        options: [
            "Комитет по проблемам Балхаша и Арала",
            "«Невада — Семипалатинск»",
            "«Адилет»",
            "«Азат»",
            "«Желтоксан»",
        ],
        correctAnswer: 1
    },
    {
        question: "402",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Алматы был столицей Казахстана:",
        options: [
            "с 1940 года по 1999 год.",
            "с 1927 года по 1997 год.",
            "с 1935 года по 1995 год.",
            "с 1947 года по 2000 год.",
            "с 1956 года по 1995 год.",
        ],
        correctAnswer: 1
    },
    {
        question: "403",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Участники Декабрьских  событий 1986 года образовали партию:",
        options: [
            "Алаш",
            "Адилет",
            "Азамат",
            "Желтоксан",
            "Патриот Казахстана",
        ],
        correctAnswer: 3
    },
    {
        question: "404",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Руководством СССР Декабрьские события  1986 года охарактеризованы как:",
        options: [
            "«демократическое выступление»",
            "«антиколониальное восстание»",
            "законное проявление «свободы слова»",
            "«проявление казахского национализма»",
            "«национально-освободительное движение»",
        ],
        correctAnswer: 3
    },
    {
        question: "405",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В апреле 1985 г.  провозглашен курс на:",
        options: [
            "гласность",
            "ускорение",
            "плюрализм",
            "демократизацию",
            "переход к рыночной экономике",
        ],
        correctAnswer: 1
    },
    {
        question: "406*",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Политика проводимая в СССР в 1985-1991 годах называлась:",
        options: [
            "Реставрация.",
            "Новая экономическая политика.",
            "Реконструкция.",
            "Новый курс.",
        ],
        correctAnswer: null
    },
    {
        question: "407",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Имя С.Д. Асфендиярова медицинскому университету присвоено:",
        options: [
            "1987 г.",
            "1988 г.",
            "1989 г.",
            "1990 г.",
            "1991 г.",
        ],
        correctAnswer: 2
    },
    {
        question: "408",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Год осуждения или заключения Кайрата Рыскулбекова на 20 лет:",
        options: [
            "1986 г.",
            "1987 г.",
            "1988 г.",
            "1989 г.",
            "1996 г.",
        ],
        correctAnswer: null
    },
    {
        question: "409",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Кунаев Д.А. звания Героя Социалистического Труда был удостоен:",
        options: [
            "дважды.",
            "трижды.",
            "4 раза.",
            "5 раза.",
            "7 раз.",
        ],
        correctAnswer: 1
    },
    {
        question: "410",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Назарбаев Н.А. избран Президентом КазССР:",
        options: [
            "в июне 1989 г.",
            "в апреле 1990 г.",
            "в январе 1999 г",
            "в феврале 1995 г.",
            "в декабре 1991 г.",
        ],
        correctAnswer: 1
    },
    {
        question: "411",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Казахская ССР переименована в Республику Казахстан:",
        options: [
            "1989г.",
            "1990г.",
            "1991г.",
            "1992 г.",
            "1993г.",
        ],
        correctAnswer: 2
    },
    {
        question: "412",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Протокол  о  создании СНГ подписан:",
        options: [
            "21 июня 1992 г",
            "21 апреля 1995 г.",
            "21 августа 1993 г.",
            "21 февраля 1990 г.",
            "21 декабря 1991 г.",
        ],
        correctAnswer: 4
    },
    {
        question: "413",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Приватизация  началась:",
        options: [
            "1990 г.",
            "1991 г.",
            "1992 г.",
            "1993 г.",
            "1994 г.",
        ],
        correctAnswer: 1
    },
    {
        question: "414",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Казахстан при вступлении ООН стал:",
        options: [
            "202 членом ООН.",
            "57 членом ООН.",
            "168 членом ООН.",
            "250 членом ООН.",
            "305 членом ООН.",
        ],
        correctAnswer: 2
    },
    {
        question: "415",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Национальная валюта - тенге введена:",
        options: [
            "в августе 1992 г.",
            "в ноябре 1993 г.",
            "в июне 1994 г.",
            "в феврале1995 г.",
            "в марте 1996 г.",
        ],
        correctAnswer: 1
    },
    {
        question: "416",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Указ о создании Вооруженных сил РК принят:",
        options: [
            "7 мая 1993 г.",
            "8 мая 1992 г.",
            "16 января 1994 г.",
            "15 ноября 1995 г.",
            "25 октября 1991 г.",
        ],
        correctAnswer: 1
    },
    {
        question: "417",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Первая Конституция РК  принята:",
        options: [
            "2  марта 1992г.",
            "25октября 1990г.",
            "16 декабря 1991г",
            "30 августа 1994 г.",
        ],
        correctAnswer: null
    },
    {
        question: "418",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Казахстан признан мировым сообществом независимым государство:.",
        options: [
            "1992 г.",
            "1993 г.",
            "1994 г.",
            "1995 г.",
            "1996 г.",
        ],
        correctAnswer: 0
    },
    {
        question: "419",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Казахстан вступил в ООН:",
        options: [
            "1992 г.",
            "1993 г.",
            "1994 г.",
            "1995 г.",
            "1996 г.",
        ],
        correctAnswer: 0
    },
    {
        question: "420",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "С какого года сформированный Казахстаном, Узбекистаном, Кыргызстаном батальон мира участвует в миротворческой операции ООН:",
        options: [
            "1992 г.",
            "1993 г.",
            "1994 г.",
            "1995 г.",
            "1996 г.",
        ],
        correctAnswer: 3
    },
    {
        question: "421",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В каком году был принят «Закон о государственной независимости Республики Казахстан»:",
        options: [
            "12 декабря 1990 г.",
            "16 декабря 1991 г.",
            "2 декабря 1991 г.",
            "15 ноября 1993 г.",
            "12 ноября 1992 г.",
        ],
        correctAnswer: 1
    },
    {
        question: "422",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Области, удаленные в мае 1997 г. в соответствии с указом Президента:",
        options: [
            "Алматы, Актобе, Кокшетау",
            "Жезказган, Туркестан, Алматы",
            "Кокшетау, Алматы, Семей",
            "Жезказган, Семей, Кокшетау",
            "Семей, Кокшетау, Орал",
        ],
        correctAnswer: 3
    },
    {
        question: "423",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В каком году в Москве было подписано соглашение о дальнейшем развитии сотрудничества между Россией и Казахстаном:",
        options: [
            "6 июля 1998 г.",
            "15 мая 1995 г.",
            "12 ноября 1996 г.",
            "12 сентября 1997 г.",
            "2 декабря 1991 г.",
        ],
        correctAnswer: 0
    },
    {
        question: "424",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Со сколькими странами граничит Казахстан:",
        options: [
            "8",
            "5",
            "4",
            "6",
            "7",
        ],
        correctAnswer: 1
    },
    {
        question: "425",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "«Соглашение о нераспространении ядерного оружия» Казахстан подписал:",
        options: [
            "1993 г.",
            "1994 г.",
            "1995 г.",
            "1996 г.",
            "1997 г.",
        ],
        correctAnswer: 0
    },
    {
        question: "426",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Уничтожен последний оставшийся ядерный заряд на полигоне Семей:",
        options: [
            "13 мая 1995 г.",
            "13 мая 1996 г.",
            "13 июня 1997 г.",
            "12 июня 1997 г.",
            "30 мая 1995 г.",
        ],
        correctAnswer: 4
    },
    {
        question: "427",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Торжественная  презентация новой столицы Казахстана – Астаны",
        options: [
            "В июне 1996 года.",
            "В июне 1997 года.",
            "В июне 1998 года.",
            "В июне 1999 года.",
            "В декабре 1999 года.",
        ],
        correctAnswer: 2
    },
    {
        question: "428",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Ассамблея народа Казахстана образована:",
        options: [
            "в мае 1995 г.",
            "в декабре1991 г.",
            "в декабре 1993 г.",
            "в марте 1995 г.",
            "в октябре 1995 г.",
        ],
        correctAnswer: 3
    },
    {
        question: "429",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Детский фонд ООН:",
        options: [
            "ЮНЕСКО",
            "ЮНИСЕФ",
            "ПРООН",
            "МАГАТЭ",
            "ЮНКТАД",
        ],
        correctAnswer: 1
    },
    {
        question: "430",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Первая перепись населения в Суверенном Казахстане:",
        options: [
            "1999 г.",
            "1997 г.",
            "1998 г.",
            "1996 г.",
            "2000 г.",
        ],
        correctAnswer: 0
    },
    {
        question: "431",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В научный оборот термин 'Великая Степь' ввел:",
        options: [
            "Потанин Г.Н.",
            "Бартольд В.В.",
            "Гумилев Л.Н.",
            "Сулейменов О",
            "Валиханов Ч.Ч.",
        ],
        correctAnswer: 2
    },
    {
        question: "432",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Референдум о продлении полномочий Президента РК Н.А. Назарбаева до 2000 года было проведено:",
        options: [
            "1992 г.",
            "1993 г.",
            "1994 г.",
            "1995 г.",
            "1996 г.",
        ],
        correctAnswer: 3
    },
    {
        question: "433",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Событие, произошедшее в Минске 8 декабря  1991 г.:",
        options: [
            "подписано соглашение о создании СНГ",
            "подписан Договор об экономическом сообществе",
            "издан Указ «Об образовании Совета безопасности»",
            "проведен референдум по проблеме сохранения СССР",
            "объявлено о подписании нового Союзного Договора",
        ],
        correctAnswer: 0
    },
    {
        question: "434",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Послание Главы государства Касым-Жомарта  Токаева  народу Казахстана 1 сентября 2020 г.",
        options: [
            "«Третья модернизация: глобальная конкурентоспособность»",
            "«К конкурентоспособному Казахстану, конкурентоспособной экономике, конкурентоспособному нации»",
            "«Повышение благосостояния  граждан Казахстана - главная цель государственной политики».",
            "«Казахстан в новой реальности: время действий»",
            "«Ускоренная экономическая модернизация – продолжение Программы форсированной инновационной индустриализации».",
        ],
        correctAnswer: 3
    },
    {
        question: "435",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В соответствии с Основным  законом РК действуют формы  собственности:",
        options: [
            "частная и государственная",
            "кооперативная и государственная",
            "государственная и акционерная",
            "кооперативная и частная",
            "арендная и государственная",
        ],
        correctAnswer: 0
    },
    {
        question: "436",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Местные  исполнительные органы  согласно Конституции  РК:",
        options: [
            "акиматы",
            "маслихаты",
            "сенат",
            "мажилис",
            "департамент",
        ],
        correctAnswer: 0
    },
    {
        question: "437",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Основная цель внешней политики независимого Казахстана:",
        options: [
            "Сбор больших денег и привлечение инвесторов.",
            "Придерживаясь агрессивной позиции и нарушая территориальную целостность соседних стран.",
            "Обеспечение безопасности страны, вхождение региональных и субрегиональных структур в политические и экономические отношения.",
            "Демаркация от соседних стран, отделение и превращение страны в замкнутое общество без связи.",
            "Неспособность установить регулярные или эпизодические контакты с представителями других государств на различных уровнях.",
        ],
        correctAnswer: 2
    },
    {
        question: "438",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Казахстан- член Организации Объединенных Наций:",
        options: [
            "2 марта 1992 г.",
            "25 февраля 1991 г.",
            "11 июля 1995 г.",
            "13 ноября 1993 г.",
            "7 апреля 1998 г.",
        ],
        correctAnswer: 0
    },
    {
        question: "439",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Вопрос особого внимания во внешней политике Казахстана:",
        options: [
            "Улучшит импорт, установив хорошие отношения с Бразилией, Аргентиной.",
            "Стабилизация отношений с Тайванем и оказание помощи в поддержании его территориальной стабильности.",
            "Дестабилизация отношений с государством США и противоречие его позициям.",
            "Наладить экспорт в Уганду и Судан.",
            "Установление хороших отношений с ближайшими и крупнейшими соседними государствами, Россией и Китайской Народной Республикой.",
        ],
        correctAnswer: 4
    },
    {
        question: "440",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Сколько этносов проживают в Казахстане:",
        options: [
            "более 50",
            "более 70",
            "более 100",
            "более 150",
            "более 130",
        ],
        correctAnswer: 4
    },
    {
        question: "441",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Пример какой страны принят для накопительной пенсии:",
        options: [
            "Чили",
            "Франция",
            "Россия",
            "Япония",
            "Америка",
        ],
        correctAnswer: 0
    },
    {
        question: "442",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Что означало подписание Президентом Н.А. Назарбаевым Лиссабонского протокола в 1993 году:",
        options: [
            "Казахстан объявлен зоной, свободной от ядерного оружия.",
            "США оказывают большую поддержку Казахстану в сфере культурного и образовательного развития",
            "Заключено Шанхайское соглашение и создана Шанхайская организация сотрудничества.",
            "Между Казахстаном и Китаем подписано соглашение о правовом размежевании приграничной территории.",
            "В этих декларациях были приняты позиции уважения суверенитета, независимости, территориальной целостности и невмешательства во внутренние дела друг друга.",
        ],
        correctAnswer: 0
    },
    {
        question: "443",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Какие страны сегодня являются приоритетами внешней политики Казахстана:",
        options: [
            "Франция, Польша, Англия.",
            "Россия, Китай, США",
            "Швейцария, Швеция",
            "Гана, Уганда, Эстония",
            "Италия, Испания.",
        ],
        correctAnswer: 1
    },
    {
        question: "444",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Соглашение, заключенное в апреле 1996 года:",
        options: [
            "Декларация о расширении сотрудничества между Казахстаном и Россией",
            "Лиссабонский протокол",
            "Шанхайское соглашение",
            "Соглашение о членстве Казахстана в ООН",
            "Контракт между Казахстаном и Китаем",
        ],
        correctAnswer: 2
    },
    {
        question: "445",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Количество стран-участниц Шанхайского соглашения:",
        options: [
            "Япония, Новая Зеландия, Казахстан, Россия",
            "Южная Корея, Казахстан, Китай, Япония",
            "Кыргызстан, Таджикистан, Туркменистан, Монголия",
            "Россия, Таджикистан, Армения, Азербайджан",
            "Россия, Китай, Казахстан, Кыргызстан",
        ],
        correctAnswer: 4
    },
    {
        question: "446",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Вопросы, рассматриваемые в Шанхайском соглашении:",
        options: [
            "Рассмотрены вопросы импорта и экспорта.",
            "Декларация о расширении сотрудничества между странами.",
            "Были подписаны соглашения по Карашиганакскому руднику и разделу Каспийского порта.",
            "Не нарушение границы, доведение нейтральной зоны до 100 км.",
            "Вопрос поддержки США Казахстана в демократическом и экономическом развитии, использования всех возможностей сотрудничества в целях обеспечения стабильности на региональной и глобальной основе.",
        ],
        correctAnswer: 3
    },
    {
        question: "447",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "СССР  ввел  войска в Афганистан в:",
        options: [
            "марте 1976 г.",
            "январе 1977 г.",
            "апреле 1978 г.",
            "декабре 1979 г.",
            "ноябре 1980 г.",
        ],
        correctAnswer: 3
    },
    {
        question: "448",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Президент РК Назарбаев Н.А. подписал указ о закрытии Семипалатинского ядерного полигона:",
        options: [
            "28 апреля 1991г.",
            "28 августа 1991 г.",
            "28 сентября 1991 г.",
            "28 декабря 1991 г.",
            "28 октября 1991 г.",
        ],
        correctAnswer: 1
    },
    {
        question: "449",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Экологическое движение под руководством О. Сулейменова в 80-е годы XX века:",
        options: [
            "Комитет по проблемам Балхаша и Арала",
            "«Невада — Семипалатинск»",
            "«Адилет»",
            "«Азат»",
            "«Желтоксан»",
        ],
        correctAnswer: 1
    },
    {
        question: "450",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Автор Флага Республики Казахстан:",
        options: [
            "Ш. Ниязбеков.",
            "Ш. Уалиханов.",
            "Ж. Малибеков.",
            "Х. Наурызбаев.",
            "К. Алимбаев.",
        ],
        correctAnswer: 0
    },
    {
        question: "451",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Дата создания СНГ:",
        options: [
            "21 декабря 1991 г.",
            "21 января 1991 г.",
            "21 февраля 1991 г.",
            "21 марта 1991 г.",
            "21 апреля 1991 г.",
        ],
        correctAnswer: 0
    },
    {
        question: "452",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Государства-члены Шанхайской организации сотрудничества:",
        options: [
            "Казахстан, Китай, Россия",
            "Россия, Монголия, Китай",
            "Казахстан, Россия, Пакистан",
            "Китай, Монголия, Афганистан",
            "Афганистан, Казахстан Россия",
        ],
        correctAnswer: 0
    },
    {
        question: "453",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "22 мая 1992 года Казахстан стал членом организации:",
        options: [
            "ШОС",
            "ООН",
            "ЮНЕСКО",
            "НССО",
            "ВТО",
        ],
        correctAnswer: 2
    },
    {
        question: "454",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Первый Всемирный курултай  казахов состоялся:",
        options: [
            "1990 г.",
            "1991 г.",
            "1992 г.",
            "1993 г.",
            "1994 г.",
        ],
        correctAnswer: 2
    },
    {
        question: "455",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Какие государства, входят в ОДКБ:",
        options: [
            "Россия, Армения, Туркменистан",
            "Азербайджан, Кыргызстан, Казахстан",
            "Россия, Казахстан, Таджикистан",
            "Таджикистан, Узбекистан, Казахстан",
            "Армения, Таджикистан, Туркменистан",
        ],
        correctAnswer: 2
    },
    {
        question: "456",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Президент Республики Казахстан Касым-Жомарт Токаев выступил с первым посланием народу Казахстана:",
        options: [
            "5 января 2020 года.",
            "10 февраля 2019 года.",
            "15 марта 2020 года.",
            "3 апреля 2019 года.",
            "2 сентября 2019 года.",
        ],
        correctAnswer: 4
    },
    {
        question: "457",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Первые Президентские выборы в истории Казахстана состоялась:",
        options: [
            "1 декабря 1991 года",
            "16 декабря 1991 года",
            "25 октября 1991 года",
            "7 ноября 1991 года",
            "20 ноября 1991 года",
        ],
        correctAnswer: 0
    },
    {
        question: "458",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Первый Президент РК Н.А. Назарбаев подписал указ о прекращении полномочий Президента:",
        options: [
            "19 марта 2019 года",
            "15 марта 2019 года",
            "10 марта 2019 года",
            "12 марта 2019 года",
            "7 марта 2019 года",
        ],
        correctAnswer: 0
    },
    {
        question: "459",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Указом Президента «День символов» обьявлен:",
        options: [
            "4 июня",
            "14 июня",
            "31 августа",
            "22 апреля",
            "25 октября",
        ],
        correctAnswer: 0
    },
    {
        question: "460",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Первый президент Академии Наук КазССР :",
        options: [
            "Казибаев К.",
            "Сулейменов О.",
            "Садвакасов С.",
            "Сатпаев К.И.",
            "Бекмаханов Е.",
        ],
        correctAnswer: 3
    },
    {
        question: "461",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Заключено соглашение о создании Таможенного союза:",
        options: [
            "28 января 1995 года",
            "28 января 1998 года",
            "28 января 2000 года",
            "28 января 2005 года",
            "28 января 2010 года",
        ],
        correctAnswer: 0
    },
    {
        question: "462",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "16 декабря 1986 г. пленум ЦК КП Казахстана избрал его главой республиканской партийной организации:",
        options: [
            "Д.А. Конаев",
            "В.Г. Колбин",
            "Н. Назарбаев",
            "Н. Ондасынов",
            "А. Байтурсынов",
        ],
        correctAnswer: 1
    },
    {
        question: "463",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "19 августа 1992 г. Казахстан вступил в организацию :",
        options: [
            "ОПЕК",
            "ЕврАзЭС",
            "Содружество Независимых Государств",
            "Шанхайская Организация Сотрудничества",
            "Всемирная организация здравоохранения",
        ],
        correctAnswer: 4
    },
    {
        question: "464",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Указ Президента Республики Казахстан о создании Вооруженных Сил Республики Казахстан:",
        options: [
            "21 апреля 1992 г.",
            "7 мая 1992 г.",
            "5 марта 1992 г.",
            "10 февраля 1993 г.",
            "20 февраля 1992 г.",
        ],
        correctAnswer: 1
    },
    {
        question: "465",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Установление дипломатических отношений между Республикой Казахстан и ОАР:",
        options: [
            "7 мая 1992 г.",
            "10 февраля 1992 г.",
            "5 марта 1992 г.",
            "20 февраля 1992 г.",
            "21 апреля 1992 г.",
        ],
        correctAnswer: 2
    },
    {
        question: "466",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Подписано соглашение о создании Таможенного союза в 1995 году между правительствами......",
        options: [
            "Казахстан, Россия, Беларусь",
            "Казахстан, Кыргызстан, Россия",
            "Казахстан, Беларусь, Кыргызстан",
            "Кыргызстан, Беларусь, Россия",
            "Кыргызстан, Беларусь, Казахстан",
        ],
        correctAnswer: 0
    },
    {
        question: "467",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В 2005 году 18 января между Казахстаном и Россией был подписан:",
        options: [
            "Договор о государственной границе",
            "Вопрос о безопасности",
            "Договор о коллективной безопасности",
            "Экономический союз",
            "Меморандум о дружбе",
        ],
        correctAnswer: 0
    },
    {
        question: "468",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Президент Н.А. Подписание Назарбаевым Указа «О создании Республиканской гвардии Республики Казахстан»:",
        options: [
            "5 марта 1992 г.",
            "6 марта 1992 г.",
            "2 марта 1992 г.",
            "20 февраля 1992 г.",
            "16 марта 1992 г.",
        ],
        correctAnswer: 4
    },
    {
        question: "469",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Договор о создании Евразийского союза государств (ЕврАзЭС) подписан:",
        options: [
            "7 марта 1997 года.",
            "15 февраля 1999 года.",
            "1 декабря 2002 года.",
            "9 сентября 2004 года.",
            "10 октября 2000 года.",
        ],
        correctAnswer: 4
    },
    {
        question: "470",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Идейным вдохновителем и руководителем организации «Жас тулпар», созданной казахской молодежью в 60-е годы в Москве был:",
        options: [
            "Жумадилов Б.",
            "Шаханов М.",
            "Мусрепов Г.",
            "Сулейменов О.",
            "Ауэзов М.",
        ],
        correctAnswer: 4
    },
    {
        question: "471",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В 2010 году Казахстан был избран председателем какой организации:",
        options: [
            "ООН",
            "ОБСЕ",
            "СНГ",
            "ШОС",
            "Организация исламского сотрудничества",
        ],
        correctAnswer: 1
    },
    {
        question: "472",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Организация по безопасности и сотрудничеству в Европе (ОБСЕ) занимается:",
        options: [
            "с вопросами безопасности",
            "экономическими вопросами",
            "экологическими проблемами",
            "с вопросами медицинской сферы",
            "с проблемой территориального расхождения",
        ],
        correctAnswer: 0
    },
    {
        question: "473",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В 1994 году Казахстан и Китай подписали:",
        options: [
            "соглашение о ядерном оружии",
            "совместное использование каспийского порта",
            "соглашение об обеспечении",
            "соглашение о делимитации",
            "расширение границ",
        ],
        correctAnswer: 3
    },
    {
        question: "474",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Протокол  о  создании СНГ подписан:",
        options: [
            "21 июня 1992 г",
            "21 апреля 1995 г.",
            "21 августа 1993 г.",
            "21 февраля 1990 г.",
            "21 декабря 1991 г.",
        ],
        correctAnswer: 4
    },
    {
        question: "475",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Национальная валюта - тенге введена:",
        options: [
            "в августе 1992 г.",
            "в ноябре 1993 г.",
            "в июне 1994 г.",
            "в феврале1995 г.",
            "в марте 1996 г.",
        ],
        correctAnswer: 1
    },
    {
        question: "476",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Первая Конституция РК  принята:",
        options: [
            "2  марта 1992г.",
            "25октября 1990г.",
            "16 декабря 1991г",
            "30 августа 1994 г.",
            "28 января 1993г.",
        ],
        correctAnswer: 4
    },
    {
        question: "477",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Дата создания новой международной ассоциации - Шанхайская организация сотрудничества (ШОС):",
        options: [
            "16 марта 1997 года.",
            "14 сентября 1998 года.",
            "26 апреля 1999 года.",
            "7 января 2000 года.",
            "15 июня 2001года",
        ],
        correctAnswer: 4
    },
    {
        question: "478",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Историческое событие, произошедшее в июне 1992 года:",
        options: [
            "Валюта",
            "Флаг и герб",
            "Государственный язык",
            "Конституция",
            "Гимн",
        ],
        correctAnswer: 1
    },
    {
        question: "479",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Главный принцип внешней политики РК:",
        options: [
            "лидерство в регионе",
            "военный нейтралитет",
            "добрососедский, дружественный",
            "военно-стратегический",
            "политика 'открытых дверей'",
        ],
        correctAnswer: 4
    },
    {
        question: "480",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Ассамблея народа Казахстана это:",
        options: [
            "Курултай",
            "Политическая партия",
            "Совещательный орган при Президенте РК",
            "общественный фонд",
            "Конституционная организация",
        ],
        correctAnswer: 2
    },
    {
        question: "481",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Год празднования 550-летие Казахского ханства:",
        options: [
            "В 2013 году",
            "В 2015 году",
            "В 2016 году",
            "В 2017 году",
            "В 2018 году",
        ],
        correctAnswer: 1
    },
    {
        question: "482",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Председателем какой организации в 2011 году был Казахстан:",
        options: [
            "ООН",
            "ШОС",
            "СНГ",
            "Организация исламского сотрудничества",
            "УАСК",
        ],
        correctAnswer: 3
    },
    {
        question: "483",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В 2012 году Астана – город, в котором решался вопрос о проведении выставки ЭКСПО-2017:",
        options: [
            "Вашингтон",
            "Киев",
            "Париж",
            "Брюссель",
            "Копенгаген",
        ],
        correctAnswer: 2
    },
    {
        question: "484",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Благодаря сбалансированной  внешней политике Казахстан установил стратегические и партнерские отношения с государствами:",
        options: [
            "США, Россией и ФРГ",
            "Китаем,  Англией и Турцией",
            "США, Россией и Китаем",
            "Китаем, Японией и Францией",
            "Россией, Южной Кореей и Японией",
        ],
        correctAnswer: 2
    },
    {
        question: "485",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Государства, которые вошли в состав Евразийского экономического союза:",
        options: [
            "Казахстан, Украина, Китай",
            "Казахстан, Россия, Белоруссия",
            "Казахстан, США, Россия",
            "Казахстан, Китай, Россия",
            "Казахстан, Россия, Китай(?)",
        ],
        correctAnswer: 1
    },
    {
        question: "486",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "В результате  реализации программы «Культурное наследие» были обнаружены   ранее неизвестные документы: около  3 тыс. на  маньчжурском,  6 тыс. на  языке чагатаи,  -  70 на ойратском языке:",
        options: [
            "Турция.",
            "Китай.",
            "Россия.",
            "Монголия.",
            "Узбекистан.",
        ],
        correctAnswer: 1
    },
    {
        question: "487",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Авторы Герба Республики Казахстан:",
        options: [
            "Ж. Малибеков, Ш. Уалиханов",
            "К. Алимбаев, Ж. Малибеков",
            "Ш. Ниязбеков, Х. Наурызбаев",
            "Ш. Уалиханов, Ш. Ниязбеков",
            "К. Алимбаев, Ш. Ниязбеков",
        ],
        correctAnswer: 0
    },
    {
        question: "488",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Автор Флага Республики Казахстан:",
        options: [
            "Ш. Ниязбеков.",
            "Ш. Уалиханов.",
            "Ж. Малибеков.",
            "Х. Наурызбаев.",
            "К. Алимбаев.",
        ],
        correctAnswer: 0
    },
    {
        question: "489",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Казахстан как светское государство:",
        options: [
            "Религия отделена от государства",
            "Религиозные организации участвуют в выборах",
            "Религия неотделима от государства",
            "Государство вмешивается в религиозные дела",
            "Государство поддерживает все религиозные организации",
        ],
        correctAnswer: 0
    },
    {
        question: "490",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Глава Государства Касым-Жомарт Токаев 2020 год объявил годом…:",
        options: [
            "волонтера",
            "учителя",
            "врачей",
            "ветеранов",
            "историков",
        ],
        correctAnswer: 0
    },
    {
        question: "491",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Казахстан председательствовал в ОБСЕ:",
        options: [
            "В 2010 году.",
            "В 2012 году.",
            "В 2016 году.",
            "В 2018 году.",
            "В 2020 году.",
        ],
        correctAnswer: 0
    },
    {
        question: "492",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Праздник Наурыз отмечается в народе с ...:",
        options: [
            "22 апреля 1988 года.",
            "22 марта 1990 года.",
            "22 февраля 1995 года.",
            "22 марта 1997 года.",
            "22 апреля 2000 года.",
        ],
        correctAnswer: 0
    },
    {
        question: "493",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Последовательность переноса столиц в Казахстане:",
        options: [
            "Оренбург –Алматы – Астана",
            "Оренбург-Кызылорда-Алматы-Астана",
            "Оренбург –Алматы-Кызылорда - Астана",
            "Оренбург –Алматы - Верный - Астана",
            "Оренбург –Ташкент-Алматы - Астана",
        ],
        correctAnswer: 1
    },
    {
        question: "494",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Для выпускников показавших отличные результаты  в учебе Правительство учредило медаль «Алтын белгі»:",
        options: [
            "в 1997 г.",
            "в 1998 г.",
            "в 1999 г.",
            "в 2000 г.",
            "в 2001 г.",
        ],
        correctAnswer: 2
    },
    {
        question: "495",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "18 января 2005 года между Казахстаном и Россией было подписано:",
        options: [
            "Договор о государственной границе.",
            "Сотрудничество в сфере безопасности.",
            "Договор коллективной безопасности.",
            "Экономический союз.",
            "Меморандум о дружбе.",
        ],
        correctAnswer: 0
    },
    {
        question: "496",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Указом Президента «День символов» объявлен:",
        options: [
            "4 июня.",
            "14 июня.",
            "31 августа.",
            "22 апреля.",
            "25 октября.",
        ],
        correctAnswer: 0
    },
    {
        question: "497",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Токаев К.К. является действующим Президентом Республики Казахстан с:",
        options: [
            "5 января 2018 года.",
            "10 февраля 2019 года.",
            "20 марта 2019 года.",
            "27 декабря 2019 года.",
            "7 июня 2018 года.",
        ],
        correctAnswer: 2
    },
    {
        question: "498",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Президентом Республики Казахстан Токаев К.Ж. победил на внеочередных президентских выборах:",
        options: [
            "5 января 2018 года.",
            "10 февраля 2019 года.",
            "27 декабря 2019 года.",
            "7 июня 2018 года.",
            "9 июня 2019 года",
        ],
        correctAnswer: 4
    },
    {
        question: "499",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Послание Главы государства Касым-Жомарта  Токаева  народу Казахстана 1 сентября 2020 г.:",
        options: [
            "«Третья модернизация: глобальная конкурентоспособность»",
            "«К конкурентоспособному Казахстану, конкурентоспособной экономике, конкурентоспособному нации»",
            "«Повышение благосостояния  граждан Казахстана - главная цель государственной политики».",
            "«Казахстан в новой реальности: время действий»",
            "«Ускоренная экономическая модернизация – продолжение Программы форсированной инновационной индустриализации».",
        ],
        correctAnswer: 3
    },
    {
        question: "500",
        options: [
        ],
        correctAnswer: null
    },
    {
        question: "Дата послании Президента Республики Казахстан К. Ж. Токаева «Новый Казахстан: путь обновления и модернизации»:",
        options: [
            "17 мая 2020 года",
            "23 сентября 2021 года",
            "12 октября 2019 года",
            "16 марта 2022 года",
            "18 марта 2020 года",
        ],
        correctAnswer: 3
    }

];

let currentQuestionIndex = 0;
let score = 0;
let filteredQuizData = [];
let timer;
let answerSelected = false;

// Элементы интерфейса
const startScreen = document.getElementById('start-screen');
const quizScreen = document.getElementById('quiz-screen');
const questionContainer = document.getElementById('question-container');
const nextBtn = document.getElementById('next-btn');

// Обработчики выбора количества вопросов
document.querySelectorAll('.options button').forEach(btn => {
    btn.addEventListener('click', () => {
        const count = btn.dataset.count;
        startTest(count);
    });
});

function startTest(count) {
    // Фильтруем вопросы с вариантами ответов
    const availableQuestions = quizData.filter(q => q.options.length > 0);
    
    // Выбираем нужное количество
    if (count === 'all') {
        filteredQuizData = shuffleArray([...availableQuestions]);
    } else {
        const num = parseInt(count);
        filteredQuizData = shuffleArray([...availableQuestions]).slice(0, num);
    }
    
    // Настраиваем интерфейс
    document.getElementById('total').textContent = filteredQuizData.length;
    startScreen.style.display = 'none';
    quizScreen.style.display = 'block';
    
    // Показываем первый вопрос
    showQuestion();
    startTimer();
}

function shuffleArray(array) {
    for (let i = array.length - 1; i > 0; i--) {
        const j = Math.floor(Math.random() * (i + 1));
        [array[i], array[j]] = [array[j], array[i]];
    }
    return array;
}

function showQuestion() {
    answerSelected = false;
    const currentQuestion = filteredQuizData[currentQuestionIndex];
    
    // Находим номер вопроса из оригинального массива
    const originalIndex = quizData.findIndex(item => 
        item.question === currentQuestion.question && 
        item.options.length > 0
    );
    const questionNumber = quizData[originalIndex - 1]?.question || "1";
    
    questionContainer.innerHTML = `
        <div class="question-number">Вопрос ${questionNumber}</div>
        <div class="question-text">${currentQuestion.question}</div>
        ${currentQuestion.options.map((option, index) => `
            <label class="answer">
                <input type="radio" name="answer" value="${index}">
                ${option}
            </label>
        `).join('')}
    `;
    
    document.getElementById('current').textContent = currentQuestionIndex + 1;
    nextBtn.disabled = true;
    nextBtn.textContent = 'Далее';
}

function startTimer() {
    let seconds = 0;
    timer = setInterval(() => {
        seconds++;
        const hrs = Math.floor(seconds / 3600);
        const mins = Math.floor((seconds % 3600) / 60);
        const secs = seconds % 60;
        document.getElementById('time').textContent = 
            `${hrs.toString().padStart(2, '0')}:${mins.toString().padStart(2, '0')}:${secs.toString().padStart(2, '0')}`;
    }, 1000);
}

nextBtn.addEventListener('click', () => {
    if (!answerSelected) {
        const selected = document.querySelector('input[name="answer"]:checked');
        if (!selected) {
            alert('Пожалуйста, выберите ответ!');
            return;
        }
        checkAnswer(parseInt(selected.value));
        nextBtn.textContent = currentQuestionIndex < filteredQuizData.length - 1 ? 'Следующий' : 'Завершить';
    } else {
        if (currentQuestionIndex < filteredQuizData.length - 1) {
            currentQuestionIndex++;
            showQuestion();
        } else {
            endTest();
        }
    }
});

function checkAnswer(selectedIndex) {
    answerSelected = true;
    const currentQuestion = filteredQuizData[currentQuestionIndex];
    const answers = document.querySelectorAll('.answer');
    
    answers.forEach((answer, index) => {
        const radio = answer.querySelector('input');
        radio.disabled = true;
        
        if (index === currentQuestion.correctAnswer) {
            answer.classList.add('correct');
        } else if (index === selectedIndex) {
            answer.classList.add('incorrect');
        }
    });
    
    if (selectedIndex === currentQuestion.correctAnswer) {
        score++;
        document.getElementById('score').textContent = score;
    }
    
    nextBtn.disabled = false;
}

function endTest() {
    clearInterval(timer);
    questionContainer.innerHTML = `
        <h2>Тест завершён!</h2>
        <p>Правильных ответов: <strong>${score}</strong> из <strong>${filteredQuizData.length}</strong></p>
        <p>Затраченное время: <strong>${document.getElementById('time').textContent}</strong></p>
    `;
    nextBtn.style.display = 'none';
}

// Обработчик выбора ответа
document.addEventListener('change', (e) => {
    if (e.target.name === 'answer') {
        nextBtn.disabled = false;
    }
});
